cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>CAP_CF0_VAL_NXT</name>
          <description>Next capacitance values for CC0 and CF0</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xDF3F0000</resetMask>
          <fields>
            <field>
              <name>CC0_VAL</name>
              <description>Cap C0 Value</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF0_VAL</name>
              <description>Cap F0 Value</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CC0_VAL_UPDATE</name>
              <description>1 - Update the CC0 cap value with CAP_CC0_VAL_NXT.CC0_VAL</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF0_VAL_UPDATE</name>
              <description>1 - Update the CF0 cap value with CAP_CF0_VAL_NXT.CF0_VAL</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC_CTRL0</name>
          <description>Control bits for RC filter at UAB output</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x33</resetMask>
          <fields>
            <field>
              <name>RC0_RES_SEL</name>
              <description>N/A</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC0_CAP_SEL</name>
              <description>Programmable Capacitance for UAB Half 0 output

0: No capacitance
1: 4 pF
2: 8 pF
3: 12 pF</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTUP_DELAY0</name>
          <description>Startup delay</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFFF</resetMask>
          <fields>
            <field>
              <name>STARTUP_DELAY</name>
              <description>Startup delay to synchronize the UAB-SAR interface. The usage and meaning of this field depends on the value of the ALIGN_MODE bit (below).   A value of 0 disables this function.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALIGN_MODE</name>
              <description>0 - STARTUP_DELAY is number of clk_hf clocks to delay the UAB clock after a SAR Trigger for UAB-SAR alignment in scheduled mode
1 - STARTUP_DELAY is number of clk_hf clocks to delay UAB trigger to SAR for UAB-SAR alignment in unscheduled mode</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSAMPLE_CTRL0</name>
          <description>Subsample control</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SUBSAMPLE</name>
              <description>Subsampling: suppress Valid output during the first SUBSAMPLE analog clock periods. Only allow Valid output in the last of the SUBSAMPLE+1 analog clock periods.
A value of 0 will not suppress Valid output.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBSAMPLE_INIT</name>
              <description>Initial value of the subsampling down counter. Before this UAB half is running the firmware can write to this field the initial value of the subsample down counter. It is recommend that the following is true for the initial value  SUBSAMPLE_INIT&lt;=SUBSAMPLE, however this is not a requirement. Writing a bigger value can be used to postpone the very first Valid output.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_STATIC0</name>
          <description>Static switches for half 0 of the UAB</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F0F373F</resetMask>
          <fields>
            <field>
              <name>SW_G00</name>
              <description>VIN00 to OA0.vplus (AG0)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G01</name>
              <description>VIN01 to OA0.vplus (AG0)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G02</name>
              <description>VIN02 to OA0.vplus (AG0)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G03</name>
              <description>VIN03 to OA0.vplus (AG0)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_R0G</name>
              <description>REF0 to OA0.vplus (AG0)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G0G</name>
              <description>AGND0 to OA0.vplus (AG0)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_R0T</name>
              <description>REF0 to cmp0.vminus (Threshold)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G0T</name>
              <description>AGND0 to cmp0.vminus (Threshold)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_Q0T</name>
              <description>OUT1 to cmp0.vminus (Threshold)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EARLY_P0S</name>
              <description>OUT0 to Sum0 switch timing: 0=Regular, 1=Early</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EARLY_P0O</name>
              <description>OUT0 to VOUT0 switch timing: 0=Regular, 1=Early</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RMB0_BITS</name>
              <description>Risk mitigation bits (To be defined if they are used)</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STRB_RST0_SEL</name>
              <description>Select source either for VDAC strobe or analog-reset to discharge all Caps (Delsig Modulator use-case)
0 = Decimator0 half 0 analog-reset output
1 = Decimator0 half 1 analog-reset output
2 = Decimator1 half 0 analog-reset output
3 = Decimator1 half 1 analog-reset output
4 = Decimator2 half 0 analog-reset output
5 = Decimator2 half 1 analog-reset output
6 = Decimator3 half 0 analog-reset output
7 = Decimator3 half 1 analog-reset output
8-31 = generic trigger input 0-23
For PASS4B  only values 0-1 and 8-13 are legal.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STRB_RST0_EN</name>
              <description>Enable VDAC strobe or UAB analog-reset:
0: Use selected source as VDAC strobe for next CA0 and CB0 values
1: Use selected source as Analog-reset (discharge all Caps)</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MODBIT_SRC0</name>
          <description>Select source of Modbit for A,B and C branches of half 0</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F1F</resetMask>
          <fields>
            <field>
              <name>MODBIT0_SRC0_SEL</name>
              <description>Select source of modbit for A &amp; B branches
0=UAB0 half 0 comparator output
1=UAB0 half 1 comparator output
2=UAB1 half 0 comparator output
3=UAB1 half 1 comparator output
4=UAB2 half 0 comparator output
5=UAB2 half 1 comparator output
6=UAB3 half 0 comparator output
7=UAB3 half 1 comparator output
8-30 = generic trigger inputs 0-22
31=SIGN0_VAL, also used as Firmware modbit. 
For PASS4B  only values 0-1 and 8-13 and 31 are legal.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODBIT1_SRC0_SEL</name>
              <description>Select source of modbit for C branch
0=UAB0 half 0 comparator output
1=UAB0 half 1 comparator output
2=UAB1 half 0 comparator output
3=UAB1 half 1 comparator output
4=UAB2 half 0 comparator output
5=UAB2 half 1 comparator output
6=UAB3 half 0 comparator output
7=UAB3 half 1 comparator output
8-30 = generic trigger inputs 0-22
31=SIGN0_VAL, also used as Firmware modbit. 
For PASS4B  only values 0-1 and 8-13 and 31 are legal.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CA0_IN0</name>
          <description>Cap A0 input switches set 0</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_A00_CMP</name>
              <description>VIN00 to Cap A0 input, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A01_CMP</name>
              <description>VIN01 to Cap A0 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A02_CMP</name>
              <description>VIN02 to Cap A0 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A03_CMP</name>
              <description>VIN03 to Cap A0 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A0P</name>
              <description>OUT0 to Cap A0 input</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A0Q</name>
              <description>OUT1 to Cap A0 input</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CA0_IN1</name>
          <description>Cap A0 input switches set 1</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SW_AA</name>
              <description>Cap A0 input to Cap A1 input
(Note: In the UAB design this is the called AM switch)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A0R_CMP</name>
              <description>REF0 to Cap A0 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A0G_CMP</name>
              <description>AGND0 to Cap A0 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A0V_CMP</name>
              <description>VSS to Cap A0 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CA0_TOP</name>
          <description>Cap A0 top plate switches</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0FFF</resetMask>
          <fields>
            <field>
              <name>SW_R0A_CMP</name>
              <description>Cap A0 top plate to REF0, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G0A_CMP</name>
              <description>Cap A0 top plate to AGND0, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_V0A_CMP</name>
              <description>Cap A0 top plate to VSS, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S0A</name>
              <description>Cap A0 top plate to SUM0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CB0_IN0</name>
          <description>Cap B0 input switches set 0</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_B00_CMP</name>
              <description>VIN00 to Cap B0 input, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B01_CMP</name>
              <description>VIN01 to Cap B0 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B02_CMP</name>
              <description>VIN02 to Cap B0 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B03_CMP</name>
              <description>VIN03 to Cap B0 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B0P</name>
              <description>OUT0 to Cap B0 input</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B0Q</name>
              <description>OUT1 to Cap B0 input</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CB0_IN1</name>
          <description>Cap B0 input switches set 1</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SW_BB</name>
              <description>Cap B0 input to Cap B1 input
(Note: In the UAB design this is called the BM switch)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B0R_CMP</name>
              <description>REF0 to Cap B0 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B0G_CMP</name>
              <description>AGND0 to Cap B0 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B0V_CMP</name>
              <description>VSS to Cap B0 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CB0_TOP</name>
          <description>Cap A0 top plate switches</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_R0B_CMP</name>
              <description>Cap B0 top plate to REF0, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G0B_CMP</name>
              <description>Cap B0 top plate to AGND0, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_V0B_CMP</name>
              <description>Cap B0 top plate to VSS, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_T0B</name>
              <description>Cap B0 top plate Trim/Attenuation bypass</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S0B</name>
              <description>Cap B0 top plate to SUM0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CC0_IN0</name>
          <description>Cap C0 input switches set 0</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_C00_CMP</name>
              <description>VIN00 to Cap C0 input, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C01_CMP</name>
              <description>VIN01 to Cap C0 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C02_CMP</name>
              <description>VIN02 to Cap C0 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C03_CMP</name>
              <description>VIN03 to Cap C0 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C0P</name>
              <description>OUT0 to Cap C0 input</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C0Q</name>
              <description>OUT1 to Cap C0 input</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CC0_IN1</name>
          <description>Cap C0 input switches set 1</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SW_CC</name>
              <description>Cap C0 input to Cap C1 input
(Note: In the UAB design this is called the CM switch)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C0R_CMP</name>
              <description>REF0 to Cap C0 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C0G_CMP</name>
              <description>AGND0 to Cap C0 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C0V_CMP</name>
              <description>VSS to Cap C0 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
