cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>SW_CC0_TOP</name>
          <description>Cap A0 top plate switches</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_R0C_CMP</name>
              <description>Cap C0 top plate to REF0, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G0C_CMP</name>
              <description>Cap C0 top plate to AGND0, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_V0C_CMP</name>
              <description>Cap C0 top plate to VSS, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_T0C</name>
              <description>Cap C0 top plate Trim/Attenuation bypass</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S0C</name>
              <description>Cap C0 top plate to SUM0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S10</name>
              <description>Cap C0 top plate to SUM1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CF0_BOT</name>
          <description>Cap F0 bottom plate and output switches</description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SW_G0F</name>
              <description>Cap F0 bottom plate to AGND0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_P0F</name>
              <description>Cap F0 bottom plate to OUT0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_P0S</name>
              <description>Cap F bypass, OUT0 to SUM0

Does not support Closed setting. To workaround, assign to SRAM wave with SRAM loaded with all 1's</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_P0O</name>
              <description>OUT0 to VOUT0

Does not support Closed setting. To workaround, assign to SRAM wave with SRAM loaded with all 1's</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_OTHER0</name>
          <description>Other clocked controls</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF000FFF</resetMask>
          <fields>
            <field>
              <name>CMP0_FF</name>
              <description>Clock for Flip-Flop after Comparator 0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID0</name>
              <description>Valid0, output flag to indicated that VOUT0 is valid. The Valid output can be suppressed due to sub-sampling. Note that when sub-sampling is used this clocking waveform is used to decrement the counter (decrement is aligned with the positive edge of this clocking waveform).</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG0_OUT</name>
              <description>Trigger output (for other UABs or SAR)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_SW0</name>
              <description>Strobe for dsi_sw_ctrl (modbit) update, dsi_sw_ctrl updates in sync with posedge of this wave. To disable set to 0. To enable update anytime use 15.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_RST0</name>
              <description>Use the positive edge of the selected clocking waveform to synchronize: 
 STRB_RST0_EN=0: Capacitor Value update (Capacitor Strobe)
 STRB_RST0_EN=1: UAB analog-reset update
Set to 0 to disable both functions. Result undefined for value 15.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_BOOST_CTRL0</name>
          <description>Bootstrap clock control</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>CA0_BOOST</name>
              <description>Clock for boot strap master in A branch</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CB0_BOOST</name>
              <description>Clock for boot strap master in B branch</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CC0_BOOST</name>
              <description>Clock for boot strap master in C branch</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF0_BOOST</name>
              <description>Clock for boot strap master in F branch</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUM0_BOOST</name>
              <description>Clock for boot strap master in Summing node branch</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP0_WAVE</name>
              <description>Clock for pump in half0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM0_CTRL</name>
          <description>SRAM programmed size</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xBF00000F</resetMask>
          <fields>
            <field>
              <name>LAST_STEP</name>
              <description>Last step of wave programmed in the SRAM</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_SEL0</name>
              <description>input Trigger select
0=UAB0 half 0 trigger output
1=UAB0 half 1 trigger output
2=UAB1 half 0 trigger output
3=UAB1 half 1 trigger output
4=UAB2 half 0 trigger output
5=UAB2 half 1 trigger output
6=UAB3 half 0 trigger output
7=UAB3 half 1 trigger output
8-30 = generic trigger inputs 0-22
31=SAR trigger output
For PASS4B  only values 0-1 and 8-13 and 31 are legal.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGGER_EN</name>
              <description>Enable input trigger:
0: Ignore triggers, start running immediately after setting RUN bit
1: After RUN bit is set wait for a positive edge on the selected trigger input</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN</name>
              <description>Set to start executing the waveform (may need to wait for a trigger). Clear to stop this UAB half. When RUN=0 all dynamic switches are forced open.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT0</name>
          <description>Status Current SRAM counter and comparator</description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF00001F</resetMask>
          <fields>
            <field>
              <name>CURR_STEP</name>
              <description>Current step executed from the SRAM</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Current comparator status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CURR_SUBSAMPLE</name>
              <description>Current value of the subsampling down counter. The Valid is suppressed when SUBSAMPLE_CUR!=0.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <name>SRAM0[%s]</name>
          <description>Waveform SRAM for half 0 of the UAB</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WAVE_STEP</name>
              <description>one step of the clocking waveform sequence</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OA1_CTRL</name>
          <description>Opamp, comparator, buffer  controls</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC3FF7707</resetMask>
          <fields>
            <field>
              <name>OA1_PWR</name>
              <description>Opamp1 power level</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1_PWR</name>
              <description>Comparator1 power level</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1_EDGE</name>
              <description>Comparator1 edge detect for interrupt and trigger</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabled, no interrupts will be detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1_DSI_LEVEL</name>
              <description>Comparator trigger out level : 0=pulse, 1=level</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF1_PWR</name>
              <description>Reference1 buffer power</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF1_PTS</name>
              <description>1- Pull the Reference1 buffer output to VDDA</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGND1_PWR</name>
              <description>Agnd1 buffer power</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AGND1_PTS</name>
              <description>1- Pull the Agnd1 buffer output to VDDA</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_RR</name>
              <description>Connect outputs of Reference0 and Reference1 buffer, one buffer must be off.
This is to drive both UAB halves with the same buffer, so both halves get the same offset noise.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW1_BULK_SEL</name>
              <description>Deprecated, do not change from default value</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H1_PWR</name>
              <description>UAB Half, power profile</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal, for normal analog clock speeds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRA_LOW</name>
                  <description>Ultra low power, only allowed for lower analog clock speeds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRA_HIGH</name>
                  <description>Ultra high performance, for higher analog clock speeds (also ultra high power)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CTRL1</name>
          <description>Capacitance controls</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0000060</resetMask>
          <fields>
            <field>
              <name>CB1_GND</name>
              <description>Ground unused caps of CB1 array
0: leave unused caps floating
1: ground unused caps (typical when attentuation Cap is used, e.g. for VDAC use-case)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_GND</name>
              <description>Ground unused caps of CC1 array
0: leave unused caps floating
1: ground unused caps (typical when attentuation Cap is used)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC1_SIGN_BIT</name>
              <description>Forces the sign bit to be 1 in DAC mode.  This is used to achieve a 12-bit unsigned DAC output from VSSA to VREF (2*AGND) when VDAC_MODE=2.
0: DAC outputs 0x1000-0x0FFF for range of VSSA to VREF(2*AGND)
1: DAC outputs 0x0000-0x0FFF for range of VSSA to VREF(2*AGND)</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC1_MODE_EN</name>
              <description>1: SIGN1_VAL is dedicated sign bit (FW modbit source tied to 0)                                                           0: SIGN1_VAL can be programmed to be a modbit source</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC1_MODE</name>
              <description>DAC mode, this determines the AB Cap Value decoding</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSIGNED12</name>
                  <description>Off or Unsigned 12-bit VDAC, i.e. no AB Cap value decoding.
SIGN1_VAL can be used as Firmware controlled modbit (e.g. to invert the Voltage for a Sign + Magnitude VDAC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRT_SIGNED12</name>
                  <description>Virtual signed 12-bits' VDAC. AB Cap value decoding: 
add 0x800 to the 12-bit AB Cap Value (=invert MSB), to convert the lowest signed number 0x800 to the lowest unsigned number 0x000. This is the same as the SAR handles 12-bit 'virtual' signed numbers.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIGNED13</name>
                  <description>Signed 13-bit twos complement. AB Cap value decoding: 
for negative values (SIGN1_VAL=1) the AB Cap values are inverted, the 64th B cap unit is enabled and the Voltage should be inverted.
- Voltage inversion only works if the right clocking waveforms, switch settings and reference voltages are used.
- Enabling the 64th B cap unit adds 1 so that only a AB Cap value inversion is needed to create a true twos complement.  .</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
