cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>CAP_ABCF1_VAL</name>
          <description>Capacitance values for CA1, CB1, CC1 and CF1</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F3F3FFF</resetMask>
          <fields>
            <field>
              <name>CB1_VAL</name>
              <description>Cap B1 Value, in DAC_MODE 1 and 2 this value is decoded</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CA1_VAL</name>
              <description>Cap A1 Value, in DAC_MODE 1 and 2 this value is decoded</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGN1_VAL</name>
              <description>Sign bit Value, when used in DAC_MODE, otherwise Firmware modbit.
In DAC_MODE the modbit should be used to invert the voltage on the AB Caps for the negative DAC values.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CB1_64</name>
              <description>Enable 64th Cap of CB1 array.  In DAC mode the FW setting is overridden by the hardware based on DAC_MODE setting.
1 - Enables the 64th cap.  Unless DAC_MODE is set, this will also set CB0_val[5:0] to be 6'h3F</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_VAL</name>
              <description>Cap C1 Value</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF1_VAL</name>
              <description>Cap F1 Value</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_AB1_VAL_NXT</name>
          <description>Next capacitance values for CA1 and CB1</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFF</resetMask>
          <fields>
            <field>
              <name>CB1_VAL</name>
              <description>Cap B1 Value</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CA1_VAL</name>
              <description>Cap A1 Value</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGN1_VAL</name>
              <description>Sign bit Value</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CF1_VAL_NXT</name>
          <description>Next capacitance values for CC1 and CF1</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xDF3F0000</resetMask>
          <fields>
            <field>
              <name>CC1_VAL</name>
              <description>Cap C1 Value</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF1_VAL</name>
              <description>Cap F1 Value</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_VAL_UPDATE</name>
              <description>1 - Update the CC1 cap value with CAP_CC1_VAL_NXT.CC1_VAL</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF1_VAL_UPDATE</name>
              <description>1 - Update the CF1 cap value with CAP_CF1_VAL_NXT.CF1_VAL</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC_CTRL1</name>
          <description>Control bits for RC filter at UAB output</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x33</resetMask>
          <fields>
            <field>
              <name>RC1_RES_SEL</name>
              <description>N/A</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC1_CAP_SEL</name>
              <description>Programmable Capacitance for UAB Half 1 output

0: No capacitance
1: 4 pF
2: 8 pF
3: 12 pF</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTUP_DELAY1</name>
          <description>Startup delay</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFFF</resetMask>
          <fields>
            <field>
              <name>STARTUP_DELAY</name>
              <description>Startup delay to synchronize the UAB-SAR interface. The usage and meaning of this field depends on the value of the ALIGN_MODE bit (below).   A value of 0 disables this function.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALIGN_MODE</name>
              <description>0 - STARTUP_DELAY is number of clk_hf clocks to delay the UAB clock after a SAR Trigger for UAB-SAR alignment in scheduled mode
1 - STARTUP_DELAY is number of clk_hf clocks to delay UAB trigger to SAR for UAB-SAR alignment in unscheduled mode</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSAMPLE_CTRL1</name>
          <description>Subsample control</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SUBSAMPLE</name>
              <description>Subsampling: suppress Valid output during the first SUBSAMPLE analog clock periods. Only allow Valid output in the last of the SUBSAMPLE+1 analog clock periods.
A value of 0 will not suppress Valid output.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBSAMPLE_INIT</name>
              <description>Initial value of the subsampling down counter. Before this UAB half is running the firmware can write to this field the initial value of the subsample down counter. It is recommend that the following is true for the initial value  SUBSAMPLE_INIT&lt;=SUBSAMPLE, however this is not a requirement. Writing a bigger value can be used to postpone the very first Valid output.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_STATIC1</name>
          <description>Static switches for half 1 of the UAB</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F0F373F</resetMask>
          <fields>
            <field>
              <name>SW_G10</name>
              <description>VIN10 to OA1.vplus (AG1)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G11</name>
              <description>VIN11 to OA1.vplus (AG1)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G12</name>
              <description>VIN12 to OA1.vplus (AG1)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G13</name>
              <description>VIN13 to OA1.vplus (AG1)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_R1G</name>
              <description>REF1 to OA1.vplus (AG1)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G1G</name>
              <description>AGND1 to OA1.vplus (AG1)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_R1T</name>
              <description>REF1 to cmp1.vminus (Threshold)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G1T</name>
              <description>AGND1 to cmp1.vminus (Threshold)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_P1T</name>
              <description>OUT0 to cmp1.vminus (Threshold)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EARLY_Q1S</name>
              <description>OUT1 to Sum1 switch timing: 0=Regular, 1=Early</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EARLY_Q1O</name>
              <description>OUT1 to VOUT1 switch timing: 0=Regular, 1=Early</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RMB1_BITS</name>
              <description>Risk mitigation bits (To be defined if they are used)</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STRB_RST1_SEL</name>
              <description>Select source either for VDAC strobe or analog-reset to discharge all Caps (Delsig Modulator use-case)
0 = Decimator0 half 0 analog-reset output
1 = Decimator0 half 1 analog-reset output
2 = Decimator1 half 0 analog-reset output
3 = Decimator1 half 1 analog-reset output
4 = Decimator2 half 0 analog-reset output
5 = Decimator2 half 1 analog-reset output
6 = Decimator3 half 0 analog-reset output
7 = Decimator3 half 1 analog-reset output
8-31 = generic trigger input 0-23
For PASS4B  only values 0-1 and 8-13 are legal.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STRB_RST1_EN</name>
              <description>Enable VDAC strobe or UAB analog-reset:
0: Use selected source as VDAC strobe for next CA1 and CB1 values
1: Use selected source as Analog-reset (discharge all Caps)</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MODBIT_SRC1</name>
          <description>Select source of Modbit for A,B and C branches of half 1</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F1F</resetMask>
          <fields>
            <field>
              <name>MODBIT0_SRC1_SEL</name>
              <description>Select source of modbit for A &amp; B branches
0=UAB0 half 0 comparator output
1=UAB0 half 1 comparator output
2=UAB1 half 0 comparator output
3=UAB1 half 1 comparator output
4=UAB2 half 0 comparator output
5=UAB2 half 1 comparator output
6=UAB3 half 0 comparator output
7=UAB3 half 1 comparator output
8-30 = generic trigger inputs 0-22
31=SIGN1_VAL, also used as Firmware modbit.
For PASS4B  only values 0-1 and 8-13 and 31 are legal.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODBIT1_SRC1_SEL</name>
              <description>Select source of modbit for C branch
0=UAB0 half 0 comparator output
1=UAB0 half 1 comparator output
2=UAB1 half 0 comparator output
3=UAB1 half 1 comparator output
4=UAB2 half 0 comparator output
5=UAB2 half 1 comparator output
6=UAB3 half 0 comparator output
7=UAB3 half 1 comparator output
8-30 = generic trigger inputs 0-22
31=SIGN1_VAL, also used as Firmware modbit.
For PASS4B  only values 0-1 and 8-11 and 31 are legal.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CA1_IN0</name>
          <description>Cap A1 input switches set 0</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_A10_CMP</name>
              <description>VIN10 to Cap A1 input, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A11_CMP</name>
              <description>VIN11 to Cap A1 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A12_CMP</name>
              <description>VIN12 to Cap A1 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A13_CMP</name>
              <description>VIN13 to Cap A1 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A1P</name>
              <description>OUT1 to Cap A1 input</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A1Q</name>
              <description>OUT0 to Cap A1 input</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CA1_IN1</name>
          <description>Cap A1 input switches set 1</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF0</resetMask>
          <fields>
            <field>
              <name>SW_A1R_CMP</name>
              <description>REF1 to Cap A1 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A1G_CMP</name>
              <description>AGND1 to Cap A1 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_A1V_CMP</name>
              <description>VSS to Cap A1 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CA1_TOP</name>
          <description>Cap A1 top plate switches</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0FFF</resetMask>
          <fields>
            <field>
              <name>SW_R1A_CMP</name>
              <description>Cap A1 top plate to REF1, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G1A_CMP</name>
              <description>Cap A1 top plate to AGND1, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_V1A_CMP</name>
              <description>Cap A1 top plate to VSS, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S1A</name>
              <description>Cap A1 top plate to SUM1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CB1_IN0</name>
          <description>Cap B1 input switches set 0</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_B10_CMP</name>
              <description>VIN10 to Cap B1 input, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B11_CMP</name>
              <description>VIN11 to Cap B1 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B12_CMP</name>
              <description>VIN12 to Cap B1 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B13_CMP</name>
              <description>VIN13 to Cap B1 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B1P</name>
              <description>OUT1 to Cap B1 input</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B1Q</name>
              <description>OUT0 to Cap B1 input</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CB1_IN1</name>
          <description>Cap B1 input switches set 1</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF0</resetMask>
          <fields>
            <field>
              <name>SW_B1R_CMP</name>
              <description>REF1 to Cap B1 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B1G_CMP</name>
              <description>AGND1 to Cap B1 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_B1V_CMP</name>
              <description>VSS to Cap B1 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CB1_TOP</name>
          <description>Cap A1 top plate switches</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_R1B_CMP</name>
              <description>Cap B1 top plate to REF1, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G1B_CMP</name>
              <description>Cap B1 top plate to AGND1, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_V1B_CMP</name>
              <description>Cap B1 top plate to VSS, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_T1B</name>
              <description>Cap B1 top plate Trim/Attenuation bypass</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S1B</name>
              <description>Cap B1 top plate to SUM1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
