cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>SW_CC1_IN0</name>
          <description>Cap C1 input switches set 0</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_C10_CMP</name>
              <description>VIN10 to Cap C1 input, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C11_CMP</name>
              <description>VIN11 to Cap C1 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C12_CMP</name>
              <description>VIN12 to Cap C1 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C13_CMP</name>
              <description>VIN13 to Cap C1 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C1P</name>
              <description>OUT1 to Cap C1 input</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C1Q</name>
              <description>OUT0 to Cap C1 input</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CC1_IN1</name>
          <description>Cap C1 input switches set 1</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF0</resetMask>
          <fields>
            <field>
              <name>SW_C1R_CMP</name>
              <description>REF1 to Cap C1 input, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C1G_CMP</name>
              <description>AGND1 to Cap C1 input, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_C1V_CMP</name>
              <description>VSS to Cap C1 input, allows for modbit control</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CC1_TOP</name>
          <description>Cap A1 top plate switches</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_R1C_CMP</name>
              <description>Cap C1 top plate to REF1, allows for modbit control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_G1C_CMP</name>
              <description>Cap C1 top plate to AGND1, allows for modbit control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_V1C_CMP</name>
              <description>Cap C1 top plate to VSS, allows for modbit control</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_T1C</name>
              <description>Cap C1 top plate Trim/Attenuation bypass</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S1C</name>
              <description>Cap C1 top plate to SUM1</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_S01</name>
              <description>Cap C1 top plate to SUM0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_CF1_BOT</name>
          <description>Cap F1 bottom plate and output switches</description>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SW_G1F</name>
              <description>Cap F1 bottom plate to AGND1</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_Q1F</name>
              <description>Cap F1 bottom plate to OUT1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_Q1S</name>
              <description>Cap F bypass, OUT1 to SUM1

Does not support Closed setting. To workaround, assign to SRAM wave with SRAM loaded with all 1's</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_Q1O</name>
              <description>OUT1 to VOUT1

Does not support Closed setting. To workaround, assign to SRAM wave with SRAM loaded with all 1's</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_OTHER1</name>
          <description>Other clocked controls</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF000FFF</resetMask>
          <fields>
            <field>
              <name>CMP1_FF</name>
              <description>Clock for Flip-Flop after Comparator 1</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VALID1</name>
              <description>Valid1, output flag to indicated that VOUT1 is valid. The Valid output can be suppressed due to sub-sampling. Note that when sub-sampling is used this clocking waveform is used to decrement the counter (decrement is aligned with the positive edge of this clocking waveform).</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG1_OUT</name>
              <description>Trigger output (for other UABs or SAR)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_SW1</name>
              <description>Strobe for dsi_sw_ctrl (modbit) update, dsi_sw_ctrl updates in sync with posedge of this wave. To disable set to 0. To enable update anytime use 15.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_RST1</name>
              <description>Use the positive edge of the selected clocking waveform to synchronize: 
 STRB_RST0_EN=0: Capacitor Value update (Capacitor Strobe)
 STRB_RST0_EN=1: UAB analog-reset update
Set to 0 to disable both functions. Result undefined for value 15.</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_BOOST_CTRL1</name>
          <description>Bootstrap clock control</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>CA1_BOOST</name>
              <description>Clock for boot strap master in A branch</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CB1_BOOST</name>
              <description>Clock for boot strap master in B branch</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_BOOST</name>
              <description>Clock for boot strap master in C branch</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF1_BOOST</name>
              <description>Clock for boot strap master in F branch</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUM1_BOOST</name>
              <description>Clock for boot strap master in Summing node branch</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP1_WAVE</name>
              <description>Clock for pump in half1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM1_CTRL</name>
          <description>SRAM programmed size</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xBF00000F</resetMask>
          <fields>
            <field>
              <name>LAST_STEP</name>
              <description>Last step of wave programmed in the SRAM</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_SEL1</name>
              <description>Trigger select
0=UAB0 half 0 trigger output
1=UAB0 half 1 trigger output
2=UAB1 half 0 trigger output
3=UAB1 half 1 trigger output
4=UAB2 half 0 trigger output
5=UAB2 half 1 trigger output
6=UAB3 half 0 trigger output
7=UAB3 half 1 trigger output
8-30 = generic trigger inputs 0-22
31=SAR trigger output
For PASS4B  only values 0-1 and 8-13 and 31 are legal.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGGER_EN</name>
              <description>Enable input trigger:
0: Ignore triggers, start running immediately after setting RUN bit
1: After RUN bit is set wait for a positive edge on the selected trigger input</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN</name>
              <description>Set to start executing the waveform (may need to wait for a trigger). Clear to stop this UAB half. When RUN=0 all dynamic switches are forced open.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT1</name>
          <description>Status Current SRAM counter and comparator</description>
          <addressOffset>0x37C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF00001F</resetMask>
          <fields>
            <field>
              <name>CURR_STEP</name>
              <description>Current step executed from the SRAM</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Current comparator status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CURR_SUBSAMPLE</name>
              <description>Current value of the subsampling down counter. The Valid is suppressed when SUBSAMPLE_CUR!=0.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <name>SRAM1[%s]</name>
          <description>Waveform SRAM for half 1 of the UAB</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>WAVE_STEP</name>
              <description>one step of the clocking waveform sequence</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DECM_CTRL</name>
          <description>Global decimator control</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>- 0: Decimator disabled (independent of UAB)
- 1: Decimator enabled (independent of UAB)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_CTRL</name>
          <description>decimator0 control</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF1FF3</resetMask>
          <fields>
            <field>
              <name>DC0_START</name>
              <description>Start decimator. In incremental mode, this bit is cleared by HW when done. In continuous mode this bit is ignored, but still gets cleared after the first decimation is done.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC0_MODE</name>
              <description>Operation mode
0: Incremental (one-shot) operation, wait for a firmware (START) or hardware trigger before starting
1: Continuous operation, continuously keep running, ignore triggers</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC0_SEL</name>
              <description>Source select</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UAB_H0</name>
                  <description>Comparator output from Half0 of this UAB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UAB_H1</name>
                  <description>Comparator output from Half1 of this UAB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI0</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI1</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC0_TYPE</name>
              <description>decimator type (filter order)</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINC1</name>
                  <description>first order</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC2</name>
                  <description>second order</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC3</name>
                  <description>third order, this uses half of decimator1, therefore cannot be combined with dc1_mode SINC2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC0_SHIFT</name>
              <description>shift the result right by specified amount, legal range 0..16</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC0_RATIO</name>
              <description>decimation ratio = DC0_RATIO+1, range 1..512</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_TRIG</name>
          <description>decimator0 trigger control</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F000000</resetMask>
          <fields>
            <field>
              <name>DC0_TRIG_SEL</name>
              <description>Trigger select
0=UAB0 half 0 trigger output
1=UAB0 half 1 trigger output
2=UAB1 half 0 trigger output
3=UAB1 half 1 trigger output
4=UAB2 half 0 trigger output
5=UAB2 half 1 trigger output
6=UAB3 half 0 trigger output
7=UAB3 half 1 trigger output
8-30 = generic trigger inputs 0-22
31=SAR trigger output
For PASS4B  only values 0-1 and 8-11 and 31 are legal.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC0_DSI_TRIG_EN</name>
              <description>Decimator DSI trigger input Enable
0: Firmware trigger only (START), ignore decimator DSI trigger input
1: Enable the DSI decimator trigger input</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC0_DSI_TRIG_LEVEL</name>
              <description>- 0: trigger signal is a pulse input, a positive edge detected on the trigger signal triggers a new decimation
- 1: trigger signal is a level input, as long as the trigger signal remains high the decimator will keep running.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_OVR</name>
          <description>decimator 0 overflow control</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>DC0_OVR_CORR_LOC</name>
              <description>Bit location for overflow correction. This should be set to FILTER_ORDER*log2(DC0_RATIO)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_A0</name>
          <description>decimator0 accumulator 0</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>A0</name>
              <description>24-bit sign extended accumulator0 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_A1</name>
          <description>decimator0 accumulator 1</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>A1</name>
              <description>24-bit sign extended accumulator1 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_DEC_CNT</name>
          <description>decimator0 decimation counter</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x301FF</resetMask>
          <fields>
            <field>
              <name>INT_CNT</name>
              <description>integration/decimation down counter</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIFF_CNT</name>
              <description>differentiation down counter</description>
              <bitRange>[17:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
