cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>DC0_TMP</name>
          <description>decimator0 temporary value for differentiator</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMP</name>
              <description>24-bit sign extended differentiator temporary value status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_D0</name>
          <description>decimator0 differentiator 0</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0</name>
              <description>24-bit sign extended differentiator 0 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_D1</name>
          <description>decimator0 differentiator 1</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1</name>
              <description>24-bit sign extended differentiator 1 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_RES</name>
          <description>decimator0 result</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RES</name>
              <description>24-bit sign extended result</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC0_STATUS</name>
          <description>decimator0 status</description>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>If high then the decimator is busy. This bit is always high when MODE is set. It is useful for firmware to figure out is a hardware trigger happened.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_CTRL</name>
          <description>decimator1 control</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF1FF3</resetMask>
          <fields>
            <field>
              <name>DC1_START</name>
              <description>Start decimator. In incremental mode, this bit is cleared by HW when done. In continuous mode this bit is ignored, but still gets cleared after the first decimation is done.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC1_MODE</name>
              <description>Operation mode
0: Incremental (one-shot) operation, wait for a firmware (START) or hardware trigger before starting
1: Continuous operation, continuously keep running, ignore triggers</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC1_SEL</name>
              <description>Source select</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UAB_H0</name>
                  <description>Comparator output from Half0 of this UAB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UAB_H1</name>
                  <description>Comparator output from Half1 of this UAB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI0</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI1</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC1_TYPE</name>
              <description>decimator type (filter order)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINC1</name>
                  <description>first order</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC2</name>
                  <description>second order</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC01_CHAIN</name>
              <description>Chain decimator0 and decimator1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC1_SHIFT</name>
              <description>shift the result right by specified amount, legal range 0..16</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC1_RATIO</name>
              <description>decimation ratio = DC1_RATIO+1, range 1..512</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_TRIG</name>
          <description>decimator1 trigger control</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F000000</resetMask>
          <fields>
            <field>
              <name>DC1_TRIG_SEL</name>
              <description>Trigger select
0=UAB0 half 0 trigger output
1=UAB0 half 1 trigger output
2=UAB1 half 0 trigger output
3=UAB1 half 1 trigger output
4=UAB2 half 0 trigger output
5=UAB2 half 1 trigger output
6=UAB3 half 0 trigger output
7=UAB3 half 1 trigger output
8-30 = generic trigger inputs 0-22
31=SAR trigger output
For PASS4B  only values 0-1 and 8-11 and 31 are legal.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC1_DSI_TRIG_EN</name>
              <description>Decimator DSI trigger input Enable
0: Firmware trigger only (START), ignore decimator DSI trigger input
1: Enable the DSI decimator trigger input</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC1_DSI_TRIG_LEVEL</name>
              <description>- 0: trigger signal is a pulse input, a positive edge detected on the trigger signal triggers a new decimation
- 1: trigger signal is a level input, as long as the trigger signal remains high the decimator will keep running.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_OVR</name>
          <description>decimator 1 overflow control</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>DC1_OVR_CORR_LOC</name>
              <description>Bit location for overflow correction. This should be set to FILTER_ORDER*log2(DC1_RATIO)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_A0</name>
          <description>decimator1 accumulator 0</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>A0</name>
              <description>27-bit sign extended accumulator0 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_A1</name>
          <description>decimator1 accumulator 1</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>A1</name>
              <description>27-bit sign extended accumulator1 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_DEC_CNT</name>
          <description>decimator1 decimation counter</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x301FF</resetMask>
          <fields>
            <field>
              <name>INT_CNT</name>
              <description>integration/decimation down counter</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIFF_CNT</name>
              <description>differentiation down counter</description>
              <bitRange>[17:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_TMP</name>
          <description>decimator1 temporary value for differentiator</description>
          <addressOffset>0x44C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMP</name>
              <description>27-bit sign extended differentiator temporary value status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_D0</name>
          <description>decimator1 differentiator 0</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0</name>
              <description>27-bit sign extended differentiator 0 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_D1</name>
          <description>decimator1 differentiator 1</description>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1</name>
              <description>27-bit sign extended differentiator 1 status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_RES</name>
          <description>decimator1 result</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RES</name>
              <description>27-bit sign extended result</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC1_STATUS</name>
          <description>decimator1 status</description>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>If high then the decimator is busy. This bit is always high when MODE is set. It is useful for firmware to figure out is a hardware trigger happened.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TRIM0</name>
          <description>Trim for attenuation cap half0</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CBTC0_VAL</name>
              <description>Cap B Trim 0 Value
Trim attenuation cap in branch B for DAC correctness</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TRIM1</name>
          <description>Trim for attenuation cap half0</description>
          <addressOffset>0xF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>CCTC0_VAL</name>
              <description>Cap C Trim 0 Value
Do not measure value, instead use same value as for CBTC0_VAL</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TRIM2</name>
          <description>Trim for attenuation cap half1</description>
          <addressOffset>0xF08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CBTC1_VAL</name>
              <description>Cap B Trim 1 Value
Trim attenuation cap in branch B for DAC correctness</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TRIM3</name>
          <description>Trim for attenuation cap half1</description>
          <addressOffset>0xF0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>CCTC1_VAL</name>
              <description>Cap C Trim 1 Value
Do not measure value, instead use same value as for CBTC1_VAL</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OA_TRIM0</name>
          <description>Trim for opamp and buffers half0</description>
          <addressOffset>0xF10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>OA0_OFFSET</name>
              <description>Opamp offset trim</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OA_TRIM1</name>
          <description>Trim for opamp and buffers half0</description>
          <addressOffset>0xF14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>REF0_OFFSET</name>
              <description>Reference buffer offset trim</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OA_TRIM2</name>
          <description>Trim for opamp and buffers half0</description>
          <addressOffset>0xF18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>AGND0_OFFSET</name>
              <description>Agnd buffer offset trim</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OA_TRIM3</name>
          <description>Trim for opamp and buffers half1</description>
          <addressOffset>0xF1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>OA1_OFFSET</name>
              <description>Opamp offset trim</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OA_TRIM4</name>
          <description>Trim for opamp and buffers half1</description>
          <addressOffset>0xF20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>REF1_OFFSET</name>
              <description>Reference buffer offset trim</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OA_TRIM5</name>
          <description>Trim for opamp and buffers half1</description>
          <addressOffset>0xF24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>AGND1_OFFSET</name>
              <description>Agnd buffer offset trim</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
