cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ART0</name>
      <description>Analog Routing Block</description>
      <headerStructName>ART</headerStructName>
      <baseAddress>0x40380000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>global AROUTE control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0000000</resetMask>
          <fields>
            <field>
              <name>DEEPSLEEP_ON</name>
              <description>- 0: AROUTE IP disabled off during DeepSleep power mode
- 1: AROUTE IP remains enabled during DeepSleep power mode (if ENABLED=1)</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>- 0: AROUTE IP disabled (put analog in power down, open all switches)
- 1: AROUTE IP enabled</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXVPLUS_SW</name>
          <description>sarmux_vplus switch control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x12AFFFF</resetMask>
          <fields>
            <field>
              <name>SMP_C0O0</name>
              <description>connect sarmux_vplus to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C0O1</name>
              <description>connect sarmux_vplus to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U0O0</name>
              <description>connect sarmux_vplus to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U0O1</name>
              <description>connect sarmux_vplus to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C1O0</name>
              <description>connect sarmux_vplus to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C1O1</name>
              <description>connect sarmux_vplus to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U1O0</name>
              <description>connect sarmux_vplus to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U1O1</name>
              <description>connect sarmux_vplus to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C2O0</name>
              <description>connect sarmux_vplus to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C2O1</name>
              <description>connect sarmux_vplus to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U2O0</name>
              <description>connect sarmux_vplus to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U2O1</name>
              <description>connect sarmux_vplus to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C3O0</name>
              <description>connect sarmux_vplus to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C3O1</name>
              <description>connect sarmux_vplus to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U3O0</name>
              <description>connect sarmux_vplus to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U3O1</name>
              <description>connect sarmux_vplus to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_AU1</name>
              <description>connect sarmux_vplus to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_AU3</name>
              <description>connect sarmux_vplus to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_AU5</name>
              <description>connect sarmux_vplus to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_SRP</name>
              <description>connect sarmux_vplus to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXVPLUS_SW_CLR</name>
          <description>sarmux_vplus switch control clear</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x12AFFFF</resetMask>
          <fields>
            <field>
              <name>SMP_C0O0</name>
              <description>clear sarmux_vplus to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C0O1</name>
              <description>clear sarmux_vplus to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U0O0</name>
              <description>clear sarmux_vplus to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U0O1</name>
              <description>clear sarmux_vplus to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C1O0</name>
              <description>clear sarmux_vplus to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C1O1</name>
              <description>clear sarmux_vplus to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U1O0</name>
              <description>clear sarmux_vplus to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U1O1</name>
              <description>clear sarmux_vplus to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C2O0</name>
              <description>clear sarmux_vplus to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C2O1</name>
              <description>clear sarmux_vplus to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U2O0</name>
              <description>clear sarmux_vplus to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U2O1</name>
              <description>clear sarmux_vplus to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C3O0</name>
              <description>clear sarmux_vplus to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_C3O1</name>
              <description>clear sarmux_vplus to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U3O0</name>
              <description>clear sarmux_vplus to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_U3O1</name>
              <description>clear sarmux_vplus to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_AU1</name>
              <description>clear sarmux_vplus to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_AU3</name>
              <description>clear sarmux_vplus to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_AU5</name>
              <description>clear sarmux_vplus to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMP_SRP</name>
              <description>clear sarmux_vplus to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXVMINUS_SW</name>
          <description>sarmux_vminus switch control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8215FFFF</resetMask>
          <fields>
            <field>
              <name>SMM_C0O0</name>
              <description>connect sarmux_vminus to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C0O1</name>
              <description>connect sarmux_vminus to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U0O0</name>
              <description>connect sarmux_vminus to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U0O1</name>
              <description>connect sarmux_vminus to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C1O0</name>
              <description>connect sarmux_vminus to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C1O1</name>
              <description>connect sarmux_vminus to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U1O0</name>
              <description>connect sarmux_vminus to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U1O1</name>
              <description>connect sarmux_vminus to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C2O0</name>
              <description>connect sarmux_vminus to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C2O1</name>
              <description>connect sarmux_vminus to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U2O0</name>
              <description>connect sarmux_vminus to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U2O1</name>
              <description>connect sarmux_vminus to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C3O0</name>
              <description>connect sarmux_vminus to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C3O1</name>
              <description>connect sarmux_vminus to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U3O0</name>
              <description>connect sarmux_vminus to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U3O1</name>
              <description>connect sarmux_vminus to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_AU0</name>
              <description>connect sarmux_vminus to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_AU2</name>
              <description>connect sarmux_vminus to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_AU4</name>
              <description>connect sarmux_vminus to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_SRM</name>
              <description>connect sarmux_vminus to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VSSA_SRM</name>
              <description>connect vssa to sar_vminus</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXVMINUS_SW_CLR</name>
          <description>sarmux_vminus switch control clear</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8215FFFF</resetMask>
          <fields>
            <field>
              <name>SMM_C0O0</name>
              <description>clear sarmux_vminus to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C0O1</name>
              <description>clear sarmux_vminus to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U0O0</name>
              <description>clear sarmux_vminus to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U0O1</name>
              <description>clear sarmux_vminus to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C1O0</name>
              <description>clear sarmux_vminus to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C1O1</name>
              <description>clear sarmux_vminus to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U1O0</name>
              <description>clear sarmux_vminus to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U1O1</name>
              <description>clear sarmux_vminus to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C2O0</name>
              <description>clear sarmux_vminus to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C2O1</name>
              <description>clear sarmux_vminus to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U2O0</name>
              <description>clear sarmux_vminus to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U2O1</name>
              <description>clear sarmux_vminus to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C3O0</name>
              <description>clear sarmux_vminus to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_C3O1</name>
              <description>clear sarmux_vminus to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U3O0</name>
              <description>clear sarmux_vminus to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_U3O1</name>
              <description>clear sarmux_vminus to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_AU0</name>
              <description>clear sarmux_vminus to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_AU2</name>
              <description>clear sarmux_vminus to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_AU4</name>
              <description>clear sarmux_vminus to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMM_SRM</name>
              <description>clear sarmux_vminus to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VSSA_SRM</name>
              <description>clear vssa to sar_vminus</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
