cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>SARMUXCOREIO0_SW</name>
          <description>sarmux_coreio0 switch control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3041111</resetMask>
          <fields>
            <field>
              <name>SMC0_C0O0</name>
              <description>connect sarmux_coreio0 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_C1O0</name>
              <description>connect sarmux_coreio0 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_C2O0</name>
              <description>connect sarmux_coreio0 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_C3O0</name>
              <description>connect sarmux_coreio0 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_AU2</name>
              <description>connect sarmux_coreio0 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_SRP</name>
              <description>connect sarmux_coreio0 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_SRM</name>
              <description>connect sarmux_coreio0 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXCOREIO0_SW_CLR</name>
          <description>sarmux_coreio0 switch control clear</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3041111</resetMask>
          <fields>
            <field>
              <name>SMC0_C0O0</name>
              <description>clear sarmux_coreio0 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_C1O0</name>
              <description>clear sarmux_coreio0 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_C2O0</name>
              <description>clear sarmux_coreio0 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_C3O0</name>
              <description>clear sarmux_coreio0 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_AU2</name>
              <description>clear sarmux_coreio0 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_SRP</name>
              <description>clear sarmux_coreio0 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC0_SRM</name>
              <description>clear sarmux_coreio0 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXCOREIO1_SW</name>
          <description>sarmux_coreio1 switch control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3082222</resetMask>
          <fields>
            <field>
              <name>SMC1_C0O1</name>
              <description>connect sarmux_coreio1 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_C1O1</name>
              <description>connect sarmux_coreio1 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_C2O1</name>
              <description>connect sarmux_coreio1 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_C3O1</name>
              <description>connect sarmux_coreio1 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_AU3</name>
              <description>connect sarmux_coreio1 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_SRP</name>
              <description>connect sarmux_coreio1 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_SRM</name>
              <description>connect sarmux_coreio1 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXCOREIO1_SW_CLR</name>
          <description>sarmux_coreio1 switch control clear</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3082222</resetMask>
          <fields>
            <field>
              <name>SMC1_C0O1</name>
              <description>clear sarmux_coreio1 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_C1O1</name>
              <description>clear sarmux_coreio1 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_C2O1</name>
              <description>clear sarmux_coreio1 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_C3O1</name>
              <description>clear sarmux_coreio1 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_AU3</name>
              <description>clear sarmux_coreio1 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_SRP</name>
              <description>clear sarmux_coreio1 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC1_SRM</name>
              <description>clear sarmux_coreio1 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXCOREIO2_SW</name>
          <description>sarmux_coreio2 switch control</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3114444</resetMask>
          <fields>
            <field>
              <name>SMC2_U0O0</name>
              <description>connect sarmux_coreio2 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_U1O0</name>
              <description>connect sarmux_coreio2 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_U2O0</name>
              <description>connect sarmux_coreio2 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_U3O0</name>
              <description>connect sarmux_coreio2 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_AU0</name>
              <description>connect sarmux_coreio2 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_AU4</name>
              <description>connect sarmux_coreio2 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_SRP</name>
              <description>connect sarmux_coreio2 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_SRM</name>
              <description>connect sarmux_coreio2 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXCOREIO2_SW_CLR</name>
          <description>sarmux_coreio2 switch control clear</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3114444</resetMask>
          <fields>
            <field>
              <name>SMC2_U0O0</name>
              <description>clear sarmux_coreio2 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_U1O0</name>
              <description>clear sarmux_coreio2 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_U2O0</name>
              <description>clear sarmux_coreio2 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_U3O0</name>
              <description>clear sarmux_coreio2 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_AU0</name>
              <description>clear sarmux_coreio2 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_AU4</name>
              <description>clear sarmux_coreio2 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_SRP</name>
              <description>clear sarmux_coreio2 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC2_SRM</name>
              <description>clear sarmux_coreio2 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXCOREIO3_SW</name>
          <description>sarmux_coreio3 switch control</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3228888</resetMask>
          <fields>
            <field>
              <name>SMC3_U0O1</name>
              <description>connect sarmux_coreio3 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_U1O1</name>
              <description>connect sarmux_coreio3 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_U2O1</name>
              <description>connect sarmux_coreio3 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_U3O1</name>
              <description>connect sarmux_coreio3 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_AU1</name>
              <description>connect sarmux_coreio3 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_AU5</name>
              <description>connect sarmux_coreio3 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_SRP</name>
              <description>connect sarmux_coreio3 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_SRM</name>
              <description>connect sarmux_coreio3 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARMUXCOREIO3_SW_CLR</name>
          <description>sarmux_coreio3 switch control clear</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3228888</resetMask>
          <fields>
            <field>
              <name>SMC3_U0O1</name>
              <description>clear sarmux_coreio3 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_U1O1</name>
              <description>clear sarmux_coreio3 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_U2O1</name>
              <description>clear sarmux_coreio3 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_U3O1</name>
              <description>clear sarmux_coreio3 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_AU1</name>
              <description>clear sarmux_coreio3 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_AU5</name>
              <description>clear sarmux_coreio3 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_SRP</name>
              <description>clear sarmux_coreio3 to sar_vplus</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC3_SRM</name>
              <description>clear sarmux_coreio3 to sar_vminus</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARAROUTEVREF_SW</name>
          <description>sar_aroute_vref switch control</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x150000</resetMask>
          <fields>
            <field>
              <name>SRV_AU0</name>
              <description>connect sar_aroute_vref to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRV_AU2</name>
              <description>connect sar_aroute_vref to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRV_AU4</name>
              <description>connect sar_aroute_vref to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARAROUTEVREF_SW_CLR</name>
          <description>sar_aroute_vref switch control clear</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x150000</resetMask>
          <fields>
            <field>
              <name>SRV_AU0</name>
              <description>clear sar_aroute_vref to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRV_AU2</name>
              <description>clear sar_aroute_vref to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRV_AU4</name>
              <description>clear sar_aroute_vref to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARAROUTEVDDA_SW</name>
          <description>sar_aroute_vdda switch control</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x30000</resetMask>
          <fields>
            <field>
              <name>VDA_AU0</name>
              <description>connect sar_aroute_vdda to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDA_AU1</name>
              <description>connect sar_aroute_vdda to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARAROUTEVDDA_SW_CLR</name>
          <description>sar_aroute_vdda switch control clear</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x30000</resetMask>
          <fields>
            <field>
              <name>VDA_AU0</name>
              <description>clear sar_aroute_vdda to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDA_AU1</name>
              <description>clear sar_aroute_vdda to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
