cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB0VIN02_SW</name>
          <description>uab0_vin02 switch control</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802AA418</resetMask>
          <fields>
            <field>
              <name>U0I02_U0O1</name>
              <description>connect uab0_vin02 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_C1O0</name>
              <description>connect uab0_vin02 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_U2O0</name>
              <description>connect uab0_vin02 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_C3O1</name>
              <description>connect uab0_vin02 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_U3O1</name>
              <description>connect uab0_vin02 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_AU1</name>
              <description>connect uab0_vin02 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_AU3</name>
              <description>connect uab0_vin02 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_AU5</name>
              <description>connect uab0_vin02 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_C0C2</name>
              <description>connect uab0_vin02 to ctb0_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN02_SW_CLR</name>
          <description>uab0_vin02 switch control clear</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802AA418</resetMask>
          <fields>
            <field>
              <name>U0I02_U0O1</name>
              <description>clear uab0_vin02 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_C1O0</name>
              <description>clear uab0_vin02 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_U2O0</name>
              <description>clear uab0_vin02 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_C3O1</name>
              <description>clear uab0_vin02 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_U3O1</name>
              <description>clear uab0_vin02 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_AU1</name>
              <description>clear uab0_vin02 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_AU3</name>
              <description>clear uab0_vin02 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_AU5</name>
              <description>clear uab0_vin02 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I02_C0C2</name>
              <description>clear uab0_vin02 to ctb0_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN03_SW</name>
          <description>uab0_vin03 switch control</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0151A46</resetMask>
          <fields>
            <field>
              <name>U0I03_C0O1</name>
              <description>connect uab0_vin03 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U0O0</name>
              <description>connect uab0_vin03 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U1O0</name>
              <description>connect uab0_vin03 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_C2O1</name>
              <description>connect uab0_vin03 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U2O1</name>
              <description>connect uab0_vin03 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_C3O0</name>
              <description>connect uab0_vin03 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_AU0</name>
              <description>connect uab0_vin03 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_AU2</name>
              <description>connect uab0_vin03 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_AU4</name>
              <description>connect uab0_vin03 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U0I10</name>
              <description>connect uab0_vin03 to uab0_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_C0C1</name>
              <description>connect uab0_vin03 to ctb0_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN03_SW_CLR</name>
          <description>uab0_vin03 switch control clear</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0151A46</resetMask>
          <fields>
            <field>
              <name>U0I03_C0O1</name>
              <description>clear uab0_vin03 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U0O0</name>
              <description>clear uab0_vin03 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U1O0</name>
              <description>clear uab0_vin03 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_C2O1</name>
              <description>clear uab0_vin03 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U2O1</name>
              <description>clear uab0_vin03 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_C3O0</name>
              <description>clear uab0_vin03 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_AU0</name>
              <description>clear uab0_vin03 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_AU2</name>
              <description>clear uab0_vin03 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_AU4</name>
              <description>clear uab0_vin03 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_U0I10</name>
              <description>clear uab0_vin03 to uab0_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I03_C0C1</name>
              <description>clear uab0_vin03 to ctb0_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN10_SW</name>
          <description>uab0_vin10 switch control</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A41A9</resetMask>
          <fields>
            <field>
              <name>U0I10_C0O0</name>
              <description>connect uab0_vin10 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_U0O1</name>
              <description>connect uab0_vin10 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_C1O1</name>
              <description>connect uab0_vin10 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_U1O1</name>
              <description>connect uab0_vin10 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_C2O0</name>
              <description>connect uab0_vin10 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_U3O0</name>
              <description>connect uab0_vin10 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_AU1</name>
              <description>connect uab0_vin10 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_AU3</name>
              <description>connect uab0_vin10 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_AU5</name>
              <description>connect uab0_vin10 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_C0C0</name>
              <description>connect uab0_vin10 to ctb0_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN10_SW_CLR</name>
          <description>uab0_vin10 switch control clear</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A41A9</resetMask>
          <fields>
            <field>
              <name>U0I10_C0O0</name>
              <description>clear uab0_vin10 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_U0O1</name>
              <description>clear uab0_vin10 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_C1O1</name>
              <description>clear uab0_vin10 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_U1O1</name>
              <description>clear uab0_vin10 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_C2O0</name>
              <description>clear uab0_vin10 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_U3O0</name>
              <description>clear uab0_vin10 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_AU1</name>
              <description>clear uab0_vin10 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_AU3</name>
              <description>clear uab0_vin10 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_AU5</name>
              <description>clear uab0_vin10 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I10_C0C0</name>
              <description>clear uab0_vin10 to ctb0_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN11_SW</name>
          <description>uab0_vin11 switch control</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8015A414</resetMask>
          <fields>
            <field>
              <name>U0I11_U0O0</name>
              <description>connect uab0_vin11 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_C1O0</name>
              <description>connect uab0_vin11 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_U2O0</name>
              <description>connect uab0_vin11 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_C3O1</name>
              <description>connect uab0_vin11 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_U3O1</name>
              <description>connect uab0_vin11 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_AU0</name>
              <description>connect uab0_vin11 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_AU2</name>
              <description>connect uab0_vin11 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_AU4</name>
              <description>connect uab0_vin11 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_C0C3</name>
              <description>connect uab0_vin11 to ctb0_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN11_SW_CLR</name>
          <description>uab0_vin11 switch control clear</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8015A414</resetMask>
          <fields>
            <field>
              <name>U0I11_U0O0</name>
              <description>clear uab0_vin11 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_C1O0</name>
              <description>clear uab0_vin11 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_U2O0</name>
              <description>clear uab0_vin11 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_C3O1</name>
              <description>clear uab0_vin11 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_U3O1</name>
              <description>clear uab0_vin11 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_AU0</name>
              <description>clear uab0_vin11 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_AU2</name>
              <description>clear uab0_vin11 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_AU4</name>
              <description>clear uab0_vin11 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I11_C0C3</name>
              <description>clear uab0_vin11 to ctb0_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
