cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB0VIN12_SW</name>
          <description>uab0_vin12 switch control</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2A1A42</resetMask>
          <fields>
            <field>
              <name>U0I12_C0O1</name>
              <description>connect uab0_vin12 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_U1O0</name>
              <description>connect uab0_vin12 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_C2O1</name>
              <description>connect uab0_vin12 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_U2O1</name>
              <description>connect uab0_vin12 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_C3O0</name>
              <description>connect uab0_vin12 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_AU1</name>
              <description>connect uab0_vin12 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_AU3</name>
              <description>connect uab0_vin12 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_AU5</name>
              <description>connect uab0_vin12 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN12_SW_CLR</name>
          <description>uab0_vin12 switch control clear</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2A1A42</resetMask>
          <fields>
            <field>
              <name>U0I12_C0O1</name>
              <description>clear uab0_vin12 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_U1O0</name>
              <description>clear uab0_vin12 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_C2O1</name>
              <description>clear uab0_vin12 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_U2O1</name>
              <description>clear uab0_vin12 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_C3O0</name>
              <description>clear uab0_vin12 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_AU1</name>
              <description>clear uab0_vin12 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_AU3</name>
              <description>clear uab0_vin12 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I12_AU5</name>
              <description>clear uab0_vin12 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN13_SW</name>
          <description>uab0_vin13 switch control</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1541A1</resetMask>
          <fields>
            <field>
              <name>U0I13_C0O0</name>
              <description>connect uab0_vin13 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_C1O1</name>
              <description>connect uab0_vin13 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_U1O1</name>
              <description>connect uab0_vin13 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_C2O0</name>
              <description>connect uab0_vin13 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_U3O0</name>
              <description>connect uab0_vin13 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_AU0</name>
              <description>connect uab0_vin13 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_AU2</name>
              <description>connect uab0_vin13 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_AU4</name>
              <description>connect uab0_vin13 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VIN13_SW_CLR</name>
          <description>uab0_vin13 switch control clear</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1541A1</resetMask>
          <fields>
            <field>
              <name>U0I13_C0O0</name>
              <description>clear uab0_vin13 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_C1O1</name>
              <description>clear uab0_vin13 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_U1O1</name>
              <description>clear uab0_vin13 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_C2O0</name>
              <description>clear uab0_vin13 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_U3O0</name>
              <description>clear uab0_vin13 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_AU0</name>
              <description>clear uab0_vin13 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_AU2</name>
              <description>clear uab0_vin13 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0I13_AU4</name>
              <description>clear uab0_vin13 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTB0VREF_SW</name>
          <description>ctb0_vref0 switch control</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF000F</resetMask>
          <fields>
            <field>
              <name>C0V0_V0</name>
              <description>connect ctb0_vref0 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V0_V1</name>
              <description>connect ctb0_vref0 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V0_V2</name>
              <description>connect ctb0_vref0 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V0_V3</name>
              <description>connect ctb0_vref0 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V0</name>
              <description>connect ctb0_vref1 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V1</name>
              <description>connect ctb0_vref1 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V2</name>
              <description>connect ctb0_vref1 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V3</name>
              <description>connect ctb0_vref1 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTB0VREF_SW_CLR</name>
          <description>ctb0_vref0 switch control clear</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF000F</resetMask>
          <fields>
            <field>
              <name>C0V0_V0</name>
              <description>clear ctb0_vref0 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V0_V1</name>
              <description>clear ctb0_vref0 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V0_V2</name>
              <description>clear ctb0_vref0 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V0_V3</name>
              <description>clear ctb0_vref0 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V0</name>
              <description>clear ctb0_vref1 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V1</name>
              <description>clear ctb0_vref1 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V2</name>
              <description>clear ctb0_vref1 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C0V1_V3</name>
              <description>clear ctb0_vref1 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VREF_SW</name>
          <description>uab0_vref00 switch control</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F0F0F</resetMask>
          <fields>
            <field>
              <name>U0V00_V0</name>
              <description>connect uab0_vref00 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V00_V1</name>
              <description>connect uab0_vref00 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V00_V2</name>
              <description>connect uab0_vref00 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V00_V3</name>
              <description>connect uab0_vref00 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V0</name>
              <description>connect uab0_vref01 to vref0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V1</name>
              <description>connect uab0_vref01 to vref1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V2</name>
              <description>connect uab0_vref01 to vref2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V3</name>
              <description>connect uab0_vref01 to vref3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V0</name>
              <description>connect uab0_vref10 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V1</name>
              <description>connect uab0_vref10 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V2</name>
              <description>connect uab0_vref10 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V3</name>
              <description>connect uab0_vref10 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V0</name>
              <description>connect uab0_vref11 to vref0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V1</name>
              <description>connect uab0_vref11 to vref1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V2</name>
              <description>connect uab0_vref11 to vref2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V3</name>
              <description>connect uab0_vref11 to vref3</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB0VREF_SW_CLR</name>
          <description>uab0_vref00 switch control clear</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F0F0F</resetMask>
          <fields>
            <field>
              <name>U0V00_V0</name>
              <description>clear uab0_vref00 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V00_V1</name>
              <description>clear uab0_vref00 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V00_V2</name>
              <description>clear uab0_vref00 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V00_V3</name>
              <description>clear uab0_vref00 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V0</name>
              <description>clear uab0_vref01 to vref0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V1</name>
              <description>clear uab0_vref01 to vref1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V2</name>
              <description>clear uab0_vref01 to vref2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V01_V3</name>
              <description>clear uab0_vref01 to vref3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V0</name>
              <description>clear uab0_vref10 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V1</name>
              <description>clear uab0_vref10 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V2</name>
              <description>clear uab0_vref10 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V10_V3</name>
              <description>clear uab0_vref10 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V0</name>
              <description>clear uab0_vref11 to vref0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V1</name>
              <description>clear uab0_vref11 to vref1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V2</name>
              <description>clear uab0_vref11 to vref2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U0V11_V3</name>
              <description>clear uab0_vref11 to vref3</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
