cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB1VIN00_SW</name>
          <description>uab1_vin00 switch control</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x154124</resetMask>
          <fields>
            <field>
              <name>U1I00_U0O0</name>
              <description>connect uab1_vin00 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_C1O1</name>
              <description>connect uab1_vin00 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_C2O0</name>
              <description>connect uab1_vin00 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_U3O0</name>
              <description>connect uab1_vin00 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_AU0</name>
              <description>connect uab1_vin00 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_AU2</name>
              <description>connect uab1_vin00 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_AU4</name>
              <description>connect uab1_vin00 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN00_SW_CLR</name>
          <description>uab1_vin00 switch control clear</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x154124</resetMask>
          <fields>
            <field>
              <name>U1I00_U0O0</name>
              <description>clear uab1_vin00 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_C1O1</name>
              <description>clear uab1_vin00 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_C2O0</name>
              <description>clear uab1_vin00 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_U3O0</name>
              <description>clear uab1_vin00 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_AU0</name>
              <description>clear uab1_vin00 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_AU2</name>
              <description>clear uab1_vin00 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I00_AU4</name>
              <description>clear uab1_vin00 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN01_SW</name>
          <description>uab1_vin01 switch control</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2AA41A</resetMask>
          <fields>
            <field>
              <name>U1I01_C0O1</name>
              <description>connect uab1_vin01 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_U0O1</name>
              <description>connect uab1_vin01 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_C1O0</name>
              <description>connect uab1_vin01 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_U2O0</name>
              <description>connect uab1_vin01 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_C3O1</name>
              <description>connect uab1_vin01 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_U3O1</name>
              <description>connect uab1_vin01 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_AU1</name>
              <description>connect uab1_vin01 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_AU3</name>
              <description>connect uab1_vin01 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_AU5</name>
              <description>connect uab1_vin01 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN01_SW_CLR</name>
          <description>uab1_vin01 switch control clear</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2AA41A</resetMask>
          <fields>
            <field>
              <name>U1I01_C0O1</name>
              <description>clear uab1_vin01 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_U0O1</name>
              <description>clear uab1_vin01 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_C1O0</name>
              <description>clear uab1_vin01 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_U2O0</name>
              <description>clear uab1_vin01 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_C3O1</name>
              <description>clear uab1_vin01 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_U3O1</name>
              <description>clear uab1_vin01 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_AU1</name>
              <description>clear uab1_vin01 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_AU3</name>
              <description>clear uab1_vin01 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I01_AU5</name>
              <description>clear uab1_vin01 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN02_SW</name>
          <description>uab1_vin02 switch control</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80151A81</resetMask>
          <fields>
            <field>
              <name>U1I02_C0O0</name>
              <description>connect uab1_vin02 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_U1O1</name>
              <description>connect uab1_vin02 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_C2O1</name>
              <description>connect uab1_vin02 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_U2O1</name>
              <description>connect uab1_vin02 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_C3O0</name>
              <description>connect uab1_vin02 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_AU0</name>
              <description>connect uab1_vin02 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_AU2</name>
              <description>connect uab1_vin02 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_AU4</name>
              <description>connect uab1_vin02 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_C1C2</name>
              <description>connect uab1_vin02 to ctb1_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN02_SW_CLR</name>
          <description>uab1_vin02 switch control clear</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80151A81</resetMask>
          <fields>
            <field>
              <name>U1I02_C0O0</name>
              <description>clear uab1_vin02 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_U1O1</name>
              <description>clear uab1_vin02 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_C2O1</name>
              <description>clear uab1_vin02 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_U2O1</name>
              <description>clear uab1_vin02 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_C3O0</name>
              <description>clear uab1_vin02 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_AU0</name>
              <description>clear uab1_vin02 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_AU2</name>
              <description>clear uab1_vin02 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_AU4</name>
              <description>clear uab1_vin02 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I02_C1C2</name>
              <description>clear uab1_vin02 to ctb1_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN03_SW</name>
          <description>uab1_vin03 switch control</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC02A4164</resetMask>
          <fields>
            <field>
              <name>U1I03_U0O0</name>
              <description>connect uab1_vin03 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_C1O1</name>
              <description>connect uab1_vin03 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_U1O0</name>
              <description>connect uab1_vin03 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_C2O0</name>
              <description>connect uab1_vin03 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_U3O0</name>
              <description>connect uab1_vin03 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_AU1</name>
              <description>connect uab1_vin03 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_AU3</name>
              <description>connect uab1_vin03 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_AU5</name>
              <description>connect uab1_vin03 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_U1I10</name>
              <description>connect uab1_vin03 to uab1_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_C1C1</name>
              <description>connect uab1_vin03 to ctb1_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN03_SW_CLR</name>
          <description>uab1_vin03 switch control clear</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC02A4164</resetMask>
          <fields>
            <field>
              <name>U1I03_U0O0</name>
              <description>clear uab1_vin03 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_C1O1</name>
              <description>clear uab1_vin03 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_U1O0</name>
              <description>clear uab1_vin03 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_C2O0</name>
              <description>clear uab1_vin03 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_U3O0</name>
              <description>clear uab1_vin03 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_AU1</name>
              <description>clear uab1_vin03 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_AU3</name>
              <description>clear uab1_vin03 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_AU5</name>
              <description>clear uab1_vin03 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_U1I10</name>
              <description>clear uab1_vin03 to uab1_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I03_C1C1</name>
              <description>clear uab1_vin03 to ctb1_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN10_SW</name>
          <description>uab1_vin10 switch control</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8015A49A</resetMask>
          <fields>
            <field>
              <name>U1I10_C0O1</name>
              <description>connect uab1_vin10 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U0O1</name>
              <description>connect uab1_vin10 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_C1O0</name>
              <description>connect uab1_vin10 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U1O1</name>
              <description>connect uab1_vin10 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U2O0</name>
              <description>connect uab1_vin10 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_C3O1</name>
              <description>connect uab1_vin10 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U3O1</name>
              <description>connect uab1_vin10 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_AU0</name>
              <description>connect uab1_vin10 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_AU2</name>
              <description>connect uab1_vin10 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_AU4</name>
              <description>connect uab1_vin10 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_C1C0</name>
              <description>connect uab1_vin10 to ctb1_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
