cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB1VIN10_SW_CLR</name>
          <description>uab1_vin10 switch control clear</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8015A49A</resetMask>
          <fields>
            <field>
              <name>U1I10_C0O1</name>
              <description>clear uab1_vin10 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U0O1</name>
              <description>clear uab1_vin10 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_C1O0</name>
              <description>clear uab1_vin10 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U1O1</name>
              <description>clear uab1_vin10 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U2O0</name>
              <description>clear uab1_vin10 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_C3O1</name>
              <description>clear uab1_vin10 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_U3O1</name>
              <description>clear uab1_vin10 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_AU0</name>
              <description>clear uab1_vin10 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_AU2</name>
              <description>clear uab1_vin10 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_AU4</name>
              <description>clear uab1_vin10 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I10_C1C0</name>
              <description>clear uab1_vin10 to ctb1_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN11_SW</name>
          <description>uab1_vin11 switch control</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A1A41</resetMask>
          <fields>
            <field>
              <name>U1I11_C0O0</name>
              <description>connect uab1_vin11 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_U1O0</name>
              <description>connect uab1_vin11 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_C2O1</name>
              <description>connect uab1_vin11 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_U2O1</name>
              <description>connect uab1_vin11 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_C3O0</name>
              <description>connect uab1_vin11 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_AU1</name>
              <description>connect uab1_vin11 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_AU3</name>
              <description>connect uab1_vin11 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_AU5</name>
              <description>connect uab1_vin11 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_C1C3</name>
              <description>connect uab1_vin11 to ctb1_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN11_SW_CLR</name>
          <description>uab1_vin11 switch control clear</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A1A41</resetMask>
          <fields>
            <field>
              <name>U1I11_C0O0</name>
              <description>clear uab1_vin11 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_U1O0</name>
              <description>clear uab1_vin11 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_C2O1</name>
              <description>clear uab1_vin11 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_U2O1</name>
              <description>clear uab1_vin11 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_C3O0</name>
              <description>clear uab1_vin11 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_AU1</name>
              <description>clear uab1_vin11 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_AU3</name>
              <description>clear uab1_vin11 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_AU5</name>
              <description>clear uab1_vin11 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I11_C1C3</name>
              <description>clear uab1_vin11 to ctb1_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN12_SW</name>
          <description>uab1_vin12 switch control</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x154124</resetMask>
          <fields>
            <field>
              <name>U1I12_U0O0</name>
              <description>connect uab1_vin12 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_C1O1</name>
              <description>connect uab1_vin12 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_C2O0</name>
              <description>connect uab1_vin12 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_U3O0</name>
              <description>connect uab1_vin12 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_AU0</name>
              <description>connect uab1_vin12 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_AU2</name>
              <description>connect uab1_vin12 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_AU4</name>
              <description>connect uab1_vin12 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN12_SW_CLR</name>
          <description>uab1_vin12 switch control clear</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x154124</resetMask>
          <fields>
            <field>
              <name>U1I12_U0O0</name>
              <description>clear uab1_vin12 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_C1O1</name>
              <description>clear uab1_vin12 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_C2O0</name>
              <description>clear uab1_vin12 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_U3O0</name>
              <description>clear uab1_vin12 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_AU0</name>
              <description>clear uab1_vin12 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_AU2</name>
              <description>clear uab1_vin12 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I12_AU4</name>
              <description>clear uab1_vin12 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN13_SW</name>
          <description>uab1_vin13 switch control</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2AA41A</resetMask>
          <fields>
            <field>
              <name>U1I13_C0O1</name>
              <description>connect uab1_vin13 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_U0O1</name>
              <description>connect uab1_vin13 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_C1O0</name>
              <description>connect uab1_vin13 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_U2O0</name>
              <description>connect uab1_vin13 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_C3O1</name>
              <description>connect uab1_vin13 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_U3O1</name>
              <description>connect uab1_vin13 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_AU1</name>
              <description>connect uab1_vin13 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_AU3</name>
              <description>connect uab1_vin13 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_AU5</name>
              <description>connect uab1_vin13 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VIN13_SW_CLR</name>
          <description>uab1_vin13 switch control clear</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2AA41A</resetMask>
          <fields>
            <field>
              <name>U1I13_C0O1</name>
              <description>clear uab1_vin13 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_U0O1</name>
              <description>clear uab1_vin13 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_C1O0</name>
              <description>clear uab1_vin13 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_U2O0</name>
              <description>clear uab1_vin13 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_C3O1</name>
              <description>clear uab1_vin13 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_U3O1</name>
              <description>clear uab1_vin13 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_AU1</name>
              <description>clear uab1_vin13 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_AU3</name>
              <description>clear uab1_vin13 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1I13_AU5</name>
              <description>clear uab1_vin13 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTB1VREF_SW</name>
          <description>ctb1_vref0 switch control</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF000F</resetMask>
          <fields>
            <field>
              <name>C1V0_V0</name>
              <description>connect ctb1_vref0 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V0_V1</name>
              <description>connect ctb1_vref0 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V0_V2</name>
              <description>connect ctb1_vref0 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V0_V3</name>
              <description>connect ctb1_vref0 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V0</name>
              <description>connect ctb1_vref1 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V1</name>
              <description>connect ctb1_vref1 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V2</name>
              <description>connect ctb1_vref1 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V3</name>
              <description>connect ctb1_vref1 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTB1VREF_SW_CLR</name>
          <description>ctb1_vref0 switch control clear</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF000F</resetMask>
          <fields>
            <field>
              <name>C1V0_V0</name>
              <description>clear ctb1_vref0 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V0_V1</name>
              <description>clear ctb1_vref0 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V0_V2</name>
              <description>clear ctb1_vref0 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V0_V3</name>
              <description>clear ctb1_vref0 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V0</name>
              <description>clear ctb1_vref1 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V1</name>
              <description>clear ctb1_vref1 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V2</name>
              <description>clear ctb1_vref1 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C1V1_V3</name>
              <description>clear ctb1_vref1 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
