cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB1VREF_SW</name>
          <description>uab1_vref00 switch control</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F0F0F</resetMask>
          <fields>
            <field>
              <name>U1V00_V0</name>
              <description>connect uab1_vref00 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V00_V1</name>
              <description>connect uab1_vref00 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V00_V2</name>
              <description>connect uab1_vref00 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V00_V3</name>
              <description>connect uab1_vref00 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V0</name>
              <description>connect uab1_vref01 to vref0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V1</name>
              <description>connect uab1_vref01 to vref1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V2</name>
              <description>connect uab1_vref01 to vref2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V3</name>
              <description>connect uab1_vref01 to vref3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V0</name>
              <description>connect uab1_vref10 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V1</name>
              <description>connect uab1_vref10 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V2</name>
              <description>connect uab1_vref10 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V3</name>
              <description>connect uab1_vref10 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V0</name>
              <description>connect uab1_vref11 to vref0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V1</name>
              <description>connect uab1_vref11 to vref1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V2</name>
              <description>connect uab1_vref11 to vref2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V3</name>
              <description>connect uab1_vref11 to vref3</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB1VREF_SW_CLR</name>
          <description>uab1_vref00 switch control clear</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F0F0F</resetMask>
          <fields>
            <field>
              <name>U1V00_V0</name>
              <description>clear uab1_vref00 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V00_V1</name>
              <description>clear uab1_vref00 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V00_V2</name>
              <description>clear uab1_vref00 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V00_V3</name>
              <description>clear uab1_vref00 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V0</name>
              <description>clear uab1_vref01 to vref0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V1</name>
              <description>clear uab1_vref01 to vref1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V2</name>
              <description>clear uab1_vref01 to vref2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V01_V3</name>
              <description>clear uab1_vref01 to vref3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V0</name>
              <description>clear uab1_vref10 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V1</name>
              <description>clear uab1_vref10 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V2</name>
              <description>clear uab1_vref10 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V10_V3</name>
              <description>clear uab1_vref10 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V0</name>
              <description>clear uab1_vref11 to vref0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V1</name>
              <description>clear uab1_vref11 to vref1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V2</name>
              <description>clear uab1_vref11 to vref2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U1V11_V3</name>
              <description>clear uab1_vref11 to vref3</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN00_SW</name>
          <description>uab2_vin00 switch control</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x15A261</resetMask>
          <fields>
            <field>
              <name>U2I00_C0O0</name>
              <description>connect uab2_vin00 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_C1O1</name>
              <description>connect uab2_vin00 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_U1O0</name>
              <description>connect uab2_vin00 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_C2O1</name>
              <description>connect uab2_vin00 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_C3O1</name>
              <description>connect uab2_vin00 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_U3O1</name>
              <description>connect uab2_vin00 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_AU0</name>
              <description>connect uab2_vin00 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_AU2</name>
              <description>connect uab2_vin00 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_AU4</name>
              <description>connect uab2_vin00 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN00_SW_CLR</name>
          <description>uab2_vin00 switch control clear</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x15A261</resetMask>
          <fields>
            <field>
              <name>U2I00_C0O0</name>
              <description>clear uab2_vin00 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_C1O1</name>
              <description>clear uab2_vin00 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_U1O0</name>
              <description>clear uab2_vin00 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_C2O1</name>
              <description>clear uab2_vin00 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_C3O1</name>
              <description>clear uab2_vin00 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_U3O1</name>
              <description>clear uab2_vin00 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_AU0</name>
              <description>clear uab2_vin00 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_AU2</name>
              <description>clear uab2_vin00 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I00_AU4</name>
              <description>clear uab2_vin00 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN01_SW</name>
          <description>uab2_vin01 switch control</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2A1194</resetMask>
          <fields>
            <field>
              <name>U2I01_U0O0</name>
              <description>connect uab2_vin01 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_C1O0</name>
              <description>connect uab2_vin01 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_U1O1</name>
              <description>connect uab2_vin01 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_C2O0</name>
              <description>connect uab2_vin01 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_C3O0</name>
              <description>connect uab2_vin01 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_AU1</name>
              <description>connect uab2_vin01 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_AU3</name>
              <description>connect uab2_vin01 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_AU5</name>
              <description>connect uab2_vin01 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN01_SW_CLR</name>
          <description>uab2_vin01 switch control clear</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2A1194</resetMask>
          <fields>
            <field>
              <name>U2I01_U0O0</name>
              <description>clear uab2_vin01 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_C1O0</name>
              <description>clear uab2_vin01 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_U1O1</name>
              <description>clear uab2_vin01 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_C2O0</name>
              <description>clear uab2_vin01 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_C3O0</name>
              <description>clear uab2_vin01 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_AU1</name>
              <description>clear uab2_vin01 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_AU3</name>
              <description>clear uab2_vin01 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I01_AU5</name>
              <description>clear uab2_vin01 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN02_SW</name>
          <description>uab2_vin02 switch control</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8015480A</resetMask>
          <fields>
            <field>
              <name>U2I02_C0O1</name>
              <description>connect uab2_vin02 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_U0O1</name>
              <description>connect uab2_vin02 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_U2O1</name>
              <description>connect uab2_vin02 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_U3O0</name>
              <description>connect uab2_vin02 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_AU0</name>
              <description>connect uab2_vin02 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_AU2</name>
              <description>connect uab2_vin02 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_AU4</name>
              <description>connect uab2_vin02 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_C2C2</name>
              <description>connect uab2_vin02 to ctb2_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN02_SW_CLR</name>
          <description>uab2_vin02 switch control clear</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8015480A</resetMask>
          <fields>
            <field>
              <name>U2I02_C0O1</name>
              <description>clear uab2_vin02 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_U0O1</name>
              <description>clear uab2_vin02 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_U2O1</name>
              <description>clear uab2_vin02 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_U3O0</name>
              <description>clear uab2_vin02 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_AU0</name>
              <description>clear uab2_vin02 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_AU2</name>
              <description>clear uab2_vin02 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_AU4</name>
              <description>clear uab2_vin02 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I02_C2C2</name>
              <description>clear uab2_vin02 to ctb2_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
