cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB2VIN03_SW</name>
          <description>uab2_vin03 switch control</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC02AA661</resetMask>
          <fields>
            <field>
              <name>U2I03_C0O0</name>
              <description>connect uab2_vin03 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C1O1</name>
              <description>connect uab2_vin03 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U1O0</name>
              <description>connect uab2_vin03 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C2O1</name>
              <description>connect uab2_vin03 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U2O0</name>
              <description>connect uab2_vin03 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C3O1</name>
              <description>connect uab2_vin03 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U3O1</name>
              <description>connect uab2_vin03 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_AU1</name>
              <description>connect uab2_vin03 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_AU3</name>
              <description>connect uab2_vin03 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_AU5</name>
              <description>connect uab2_vin03 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U2I10</name>
              <description>connect uab2_vin03 to uab2_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C2C1</name>
              <description>connect uab2_vin03 to ctb2_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN03_SW_CLR</name>
          <description>uab2_vin03 switch control clear</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC02AA661</resetMask>
          <fields>
            <field>
              <name>U2I03_C0O0</name>
              <description>clear uab2_vin03 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C1O1</name>
              <description>clear uab2_vin03 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U1O0</name>
              <description>clear uab2_vin03 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C2O1</name>
              <description>clear uab2_vin03 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U2O0</name>
              <description>clear uab2_vin03 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C3O1</name>
              <description>clear uab2_vin03 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U3O1</name>
              <description>clear uab2_vin03 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_AU1</name>
              <description>clear uab2_vin03 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_AU3</name>
              <description>clear uab2_vin03 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_AU5</name>
              <description>clear uab2_vin03 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_U2I10</name>
              <description>clear uab2_vin03 to uab2_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I03_C2C1</name>
              <description>clear uab2_vin03 to ctb2_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN10_SW</name>
          <description>uab2_vin10 switch control</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80151994</resetMask>
          <fields>
            <field>
              <name>U2I10_U0O0</name>
              <description>connect uab2_vin10 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C1O0</name>
              <description>connect uab2_vin10 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_U1O1</name>
              <description>connect uab2_vin10 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C2O0</name>
              <description>connect uab2_vin10 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_U2O1</name>
              <description>connect uab2_vin10 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C3O0</name>
              <description>connect uab2_vin10 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_AU0</name>
              <description>connect uab2_vin10 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_AU2</name>
              <description>connect uab2_vin10 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_AU4</name>
              <description>connect uab2_vin10 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C2C0</name>
              <description>connect uab2_vin10 to ctb2_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN10_SW_CLR</name>
          <description>uab2_vin10 switch control clear</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80151994</resetMask>
          <fields>
            <field>
              <name>U2I10_U0O0</name>
              <description>clear uab2_vin10 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C1O0</name>
              <description>clear uab2_vin10 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_U1O1</name>
              <description>clear uab2_vin10 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C2O0</name>
              <description>clear uab2_vin10 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_U2O1</name>
              <description>clear uab2_vin10 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C3O0</name>
              <description>clear uab2_vin10 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_AU0</name>
              <description>clear uab2_vin10 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_AU2</name>
              <description>clear uab2_vin10 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_AU4</name>
              <description>clear uab2_vin10 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I10_C2C0</name>
              <description>clear uab2_vin10 to ctb2_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN11_SW</name>
          <description>uab2_vin11 switch control</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A440A</resetMask>
          <fields>
            <field>
              <name>U2I11_C0O1</name>
              <description>connect uab2_vin11 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_U0O1</name>
              <description>connect uab2_vin11 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_U2O0</name>
              <description>connect uab2_vin11 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_U3O0</name>
              <description>connect uab2_vin11 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_AU1</name>
              <description>connect uab2_vin11 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_AU3</name>
              <description>connect uab2_vin11 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_AU5</name>
              <description>connect uab2_vin11 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_C2C3</name>
              <description>connect uab2_vin11 to ctb2_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN11_SW_CLR</name>
          <description>uab2_vin11 switch control clear</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A440A</resetMask>
          <fields>
            <field>
              <name>U2I11_C0O1</name>
              <description>clear uab2_vin11 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_U0O1</name>
              <description>clear uab2_vin11 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_U2O0</name>
              <description>clear uab2_vin11 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_U3O0</name>
              <description>clear uab2_vin11 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_AU1</name>
              <description>clear uab2_vin11 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_AU3</name>
              <description>clear uab2_vin11 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_AU5</name>
              <description>clear uab2_vin11 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I11_C2C3</name>
              <description>clear uab2_vin11 to ctb2_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN12_SW</name>
          <description>uab2_vin12 switch control</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x15A261</resetMask>
          <fields>
            <field>
              <name>U2I12_C0O0</name>
              <description>connect uab2_vin12 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_C1O1</name>
              <description>connect uab2_vin12 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_U1O0</name>
              <description>connect uab2_vin12 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_C2O1</name>
              <description>connect uab2_vin12 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_C3O1</name>
              <description>connect uab2_vin12 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_U3O1</name>
              <description>connect uab2_vin12 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_AU0</name>
              <description>connect uab2_vin12 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_AU2</name>
              <description>connect uab2_vin12 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_AU4</name>
              <description>connect uab2_vin12 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN12_SW_CLR</name>
          <description>uab2_vin12 switch control clear</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x15A261</resetMask>
          <fields>
            <field>
              <name>U2I12_C0O0</name>
              <description>clear uab2_vin12 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_C1O1</name>
              <description>clear uab2_vin12 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_U1O0</name>
              <description>clear uab2_vin12 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_C2O1</name>
              <description>clear uab2_vin12 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_C3O1</name>
              <description>clear uab2_vin12 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_U3O1</name>
              <description>clear uab2_vin12 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_AU0</name>
              <description>clear uab2_vin12 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_AU2</name>
              <description>clear uab2_vin12 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I12_AU4</name>
              <description>clear uab2_vin12 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB2VIN13_SW</name>
          <description>uab2_vin13 switch control</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2A1184</resetMask>
          <fields>
            <field>
              <name>U2I13_U0O0</name>
              <description>connect uab2_vin13 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I13_U1O1</name>
              <description>connect uab2_vin13 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I13_C2O0</name>
              <description>connect uab2_vin13 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I13_C3O0</name>
              <description>connect uab2_vin13 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I13_AU1</name>
              <description>connect uab2_vin13 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I13_AU3</name>
              <description>connect uab2_vin13 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2I13_AU5</name>
              <description>connect uab2_vin13 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
