cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB3VIN01_SW_CLR</name>
          <description>uab3_vin01 switch control clear</description>
          <addressOffset>0x28C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x151941</resetMask>
          <fields>
            <field>
              <name>U3I01_C0O0</name>
              <description>clear uab3_vin01 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I01_U1O0</name>
              <description>clear uab3_vin01 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I01_C2O0</name>
              <description>clear uab3_vin01 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I01_U2O1</name>
              <description>clear uab3_vin01 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I01_C3O0</name>
              <description>clear uab3_vin01 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I01_AU0</name>
              <description>clear uab3_vin01 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I01_AU2</name>
              <description>clear uab3_vin01 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I01_AU4</name>
              <description>clear uab3_vin01 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN02_SW</name>
          <description>uab3_vin02 switch control</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A80A4</resetMask>
          <fields>
            <field>
              <name>U3I02_U0O0</name>
              <description>connect uab3_vin02 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_C1O1</name>
              <description>connect uab3_vin02 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_U1O1</name>
              <description>connect uab3_vin02 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_U3O1</name>
              <description>connect uab3_vin02 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_AU1</name>
              <description>connect uab3_vin02 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_AU3</name>
              <description>connect uab3_vin02 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_AU5</name>
              <description>connect uab3_vin02 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_C3C2</name>
              <description>connect uab3_vin02 to ctb3_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN02_SW_CLR</name>
          <description>uab3_vin02 switch control clear</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A80A4</resetMask>
          <fields>
            <field>
              <name>U3I02_U0O0</name>
              <description>clear uab3_vin02 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_C1O1</name>
              <description>clear uab3_vin02 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_U1O1</name>
              <description>clear uab3_vin02 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_U3O1</name>
              <description>clear uab3_vin02 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_AU1</name>
              <description>clear uab3_vin02 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_AU3</name>
              <description>clear uab3_vin02 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_AU5</name>
              <description>clear uab3_vin02 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I02_C3C2</name>
              <description>clear uab3_vin02 to ctb3_ctbus2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN03_SW</name>
          <description>uab3_vin03 switch control</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC015661A</resetMask>
          <fields>
            <field>
              <name>U3I03_C0O1</name>
              <description>connect uab3_vin03 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U0O1</name>
              <description>connect uab3_vin03 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C1O0</name>
              <description>connect uab3_vin03 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C2O1</name>
              <description>connect uab3_vin03 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U2O0</name>
              <description>connect uab3_vin03 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C3O1</name>
              <description>connect uab3_vin03 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U3O0</name>
              <description>connect uab3_vin03 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_AU0</name>
              <description>connect uab3_vin03 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_AU2</name>
              <description>connect uab3_vin03 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_AU4</name>
              <description>connect uab3_vin03 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U3I10</name>
              <description>connect uab3_vin03 to uab3_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C3C1</name>
              <description>connect uab3_vin03 to ctb3_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN03_SW_CLR</name>
          <description>uab3_vin03 switch control clear</description>
          <addressOffset>0x29C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC015661A</resetMask>
          <fields>
            <field>
              <name>U3I03_C0O1</name>
              <description>clear uab3_vin03 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U0O1</name>
              <description>clear uab3_vin03 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C1O0</name>
              <description>clear uab3_vin03 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C2O1</name>
              <description>clear uab3_vin03 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U2O0</name>
              <description>clear uab3_vin03 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C3O1</name>
              <description>clear uab3_vin03 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U3O0</name>
              <description>clear uab3_vin03 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_AU0</name>
              <description>clear uab3_vin03 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_AU2</name>
              <description>clear uab3_vin03 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_AU4</name>
              <description>clear uab3_vin03 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_U3I10</name>
              <description>clear uab3_vin03 to uab3_vin10</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I03_C3C1</name>
              <description>clear uab3_vin03 to ctb3_ctbus1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN10_SW</name>
          <description>uab3_vin10 switch control</description>
          <addressOffset>0x2A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A9941</resetMask>
          <fields>
            <field>
              <name>U3I10_C0O0</name>
              <description>connect uab3_vin10 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_U1O0</name>
              <description>connect uab3_vin10 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_C2O0</name>
              <description>connect uab3_vin10 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_U2O1</name>
              <description>connect uab3_vin10 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_C3O0</name>
              <description>connect uab3_vin10 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_U3O1</name>
              <description>connect uab3_vin10 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_AU1</name>
              <description>connect uab3_vin10 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_AU3</name>
              <description>connect uab3_vin10 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_AU5</name>
              <description>connect uab3_vin10 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_C3C0</name>
              <description>connect uab3_vin10 to ctb3_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN10_SW_CLR</name>
          <description>uab3_vin10 switch control clear</description>
          <addressOffset>0x2A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x802A9941</resetMask>
          <fields>
            <field>
              <name>U3I10_C0O0</name>
              <description>clear uab3_vin10 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_U1O0</name>
              <description>clear uab3_vin10 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_C2O0</name>
              <description>clear uab3_vin10 to ctb2_vout0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_U2O1</name>
              <description>clear uab3_vin10 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_C3O0</name>
              <description>clear uab3_vin10 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_U3O1</name>
              <description>clear uab3_vin10 to uab3_vout1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_AU1</name>
              <description>clear uab3_vin10 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_AU3</name>
              <description>clear uab3_vin10 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_AU5</name>
              <description>clear uab3_vin10 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I10_C3C0</name>
              <description>clear uab3_vin10 to ctb3_ctbus0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN11_SW</name>
          <description>uab3_vin11 switch control</description>
          <addressOffset>0x2A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x801540A4</resetMask>
          <fields>
            <field>
              <name>U3I11_U0O0</name>
              <description>connect uab3_vin11 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_C1O1</name>
              <description>connect uab3_vin11 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_U1O1</name>
              <description>connect uab3_vin11 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_U3O0</name>
              <description>connect uab3_vin11 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_AU0</name>
              <description>connect uab3_vin11 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_AU2</name>
              <description>connect uab3_vin11 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_AU4</name>
              <description>connect uab3_vin11 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_C3C3</name>
              <description>connect uab3_vin11 to ctb3_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN11_SW_CLR</name>
          <description>uab3_vin11 switch control clear</description>
          <addressOffset>0x2AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x801540A4</resetMask>
          <fields>
            <field>
              <name>U3I11_U0O0</name>
              <description>clear uab3_vin11 to uab0_vout0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_C1O1</name>
              <description>clear uab3_vin11 to ctb1_vout1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_U1O1</name>
              <description>clear uab3_vin11 to uab1_vout1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_U3O0</name>
              <description>clear uab3_vin11 to uab3_vout0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_AU0</name>
              <description>clear uab3_vin11 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_AU2</name>
              <description>clear uab3_vin11 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_AU4</name>
              <description>clear uab3_vin11 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I11_C3C3</name>
              <description>clear uab3_vin11 to ctb3_ctbus3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
