cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>UAB3VIN12_SW</name>
          <description>uab3_vin12 switch control</description>
          <addressOffset>0x2B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2A261A</resetMask>
          <fields>
            <field>
              <name>U3I12_C0O1</name>
              <description>connect uab3_vin12 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_U0O1</name>
              <description>connect uab3_vin12 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_C1O0</name>
              <description>connect uab3_vin12 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_C2O1</name>
              <description>connect uab3_vin12 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_U2O0</name>
              <description>connect uab3_vin12 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_C3O1</name>
              <description>connect uab3_vin12 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_AU1</name>
              <description>connect uab3_vin12 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_AU3</name>
              <description>connect uab3_vin12 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_AU5</name>
              <description>connect uab3_vin12 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN12_SW_CLR</name>
          <description>uab3_vin12 switch control clear</description>
          <addressOffset>0x2B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2A261A</resetMask>
          <fields>
            <field>
              <name>U3I12_C0O1</name>
              <description>clear uab3_vin12 to ctb0_vout1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_U0O1</name>
              <description>clear uab3_vin12 to uab0_vout1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_C1O0</name>
              <description>clear uab3_vin12 to ctb1_vout0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_C2O1</name>
              <description>clear uab3_vin12 to ctb2_vout1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_U2O0</name>
              <description>clear uab3_vin12 to uab2_vout0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_C3O1</name>
              <description>clear uab3_vin12 to ctb3_vout1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_AU1</name>
              <description>clear uab3_vin12 to acore_u1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_AU3</name>
              <description>clear uab3_vin12 to acore_u3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I12_AU5</name>
              <description>clear uab3_vin12 to acore_u5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN13_SW</name>
          <description>uab3_vin13 switch control</description>
          <addressOffset>0x2B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x151841</resetMask>
          <fields>
            <field>
              <name>U3I13_C0O0</name>
              <description>connect uab3_vin13 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_U1O0</name>
              <description>connect uab3_vin13 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_U2O1</name>
              <description>connect uab3_vin13 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_C3O0</name>
              <description>connect uab3_vin13 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_AU0</name>
              <description>connect uab3_vin13 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_AU2</name>
              <description>connect uab3_vin13 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_AU4</name>
              <description>connect uab3_vin13 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VIN13_SW_CLR</name>
          <description>uab3_vin13 switch control clear</description>
          <addressOffset>0x2BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x151841</resetMask>
          <fields>
            <field>
              <name>U3I13_C0O0</name>
              <description>clear uab3_vin13 to ctb0_vout0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_U1O0</name>
              <description>clear uab3_vin13 to uab1_vout0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_U2O1</name>
              <description>clear uab3_vin13 to uab2_vout1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_C3O0</name>
              <description>clear uab3_vin13 to ctb3_vout0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_AU0</name>
              <description>clear uab3_vin13 to acore_u0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_AU2</name>
              <description>clear uab3_vin13 to acore_u2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3I13_AU4</name>
              <description>clear uab3_vin13 to acore_u4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTB3VREF_SW</name>
          <description>ctb3_vref0 switch control</description>
          <addressOffset>0x2C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF000F</resetMask>
          <fields>
            <field>
              <name>C3V0_V0</name>
              <description>connect ctb3_vref0 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V0_V1</name>
              <description>connect ctb3_vref0 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V0_V2</name>
              <description>connect ctb3_vref0 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V0_V3</name>
              <description>connect ctb3_vref0 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V0</name>
              <description>connect ctb3_vref1 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V1</name>
              <description>connect ctb3_vref1 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V2</name>
              <description>connect ctb3_vref1 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V3</name>
              <description>connect ctb3_vref1 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTB3VREF_SW_CLR</name>
          <description>ctb3_vref0 switch control clear</description>
          <addressOffset>0x2C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF000F</resetMask>
          <fields>
            <field>
              <name>C3V0_V0</name>
              <description>clear ctb3_vref0 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V0_V1</name>
              <description>clear ctb3_vref0 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V0_V2</name>
              <description>clear ctb3_vref0 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V0_V3</name>
              <description>clear ctb3_vref0 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V0</name>
              <description>clear ctb3_vref1 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V1</name>
              <description>clear ctb3_vref1 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V2</name>
              <description>clear ctb3_vref1 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C3V1_V3</name>
              <description>clear ctb3_vref1 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VREF_SW</name>
          <description>uab3_vref00 switch control</description>
          <addressOffset>0x2C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F0F0F</resetMask>
          <fields>
            <field>
              <name>U3V00_V0</name>
              <description>connect uab3_vref00 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V00_V1</name>
              <description>connect uab3_vref00 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V00_V2</name>
              <description>connect uab3_vref00 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V00_V3</name>
              <description>connect uab3_vref00 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V0</name>
              <description>connect uab3_vref01 to vref0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V1</name>
              <description>connect uab3_vref01 to vref1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V2</name>
              <description>connect uab3_vref01 to vref2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V3</name>
              <description>connect uab3_vref01 to vref3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V0</name>
              <description>connect uab3_vref10 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V1</name>
              <description>connect uab3_vref10 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V2</name>
              <description>connect uab3_vref10 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V3</name>
              <description>connect uab3_vref10 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V0</name>
              <description>connect uab3_vref11 to vref0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V1</name>
              <description>connect uab3_vref11 to vref1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V2</name>
              <description>connect uab3_vref11 to vref2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V3</name>
              <description>connect uab3_vref11 to vref3</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UAB3VREF_SW_CLR</name>
          <description>uab3_vref00 switch control clear</description>
          <addressOffset>0x2CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F0F0F</resetMask>
          <fields>
            <field>
              <name>U3V00_V0</name>
              <description>clear uab3_vref00 to vref0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V00_V1</name>
              <description>clear uab3_vref00 to vref1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V00_V2</name>
              <description>clear uab3_vref00 to vref2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V00_V3</name>
              <description>clear uab3_vref00 to vref3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V0</name>
              <description>clear uab3_vref01 to vref0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V1</name>
              <description>clear uab3_vref01 to vref1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V2</name>
              <description>clear uab3_vref01 to vref2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V01_V3</name>
              <description>clear uab3_vref01 to vref3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V0</name>
              <description>clear uab3_vref10 to vref0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V1</name>
              <description>clear uab3_vref10 to vref1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V2</name>
              <description>clear uab3_vref10 to vref2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V10_V3</name>
              <description>clear uab3_vref10 to vref3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V0</name>
              <description>clear uab3_vref11 to vref0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V1</name>
              <description>clear uab3_vref11 to vref1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V2</name>
              <description>clear uab3_vref11 to vref2</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U3V11_V3</name>
              <description>clear uab3_vref11 to vref3</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
