cmsis-svd/cmsis-svd/data/Infineon/psoc4axx.svd
        <register>
          <name>PUMP_CTRL</name>
          <description>Switch pump control</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000001</resetMask>
          <fields>
            <field>
              <name>CLOCK_SEL</name>
              <description>Clock select: 0=external clock, 1=internal clock (deprecated).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>0=disabled: pump output is VDDA_PUMP, 1=enabled: pump output is boosted.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA_TRIM</name>
          <description>Analog trim register.</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>CAP_TRIM</name>
              <description>Attenuation cap trimming</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMUNIT</name>
              <description>Attenuation cap trimming</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WOUNDING</name>
          <description>SAR wounding register</description>
          <addressOffset>0xF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>WOUND_RESOLUTION</name>
              <description>Maximum SAR resolution allowed</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>12BIT</name>
                  <description>unwounded: up to full 12-bit SAR resolution allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BIT</name>
                  <description>wounded: max resolution upto 10-bit SAR resolution allowed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>wounded: only 8-bit SAR resolution allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BIT_TOO</name>
                  <description>wounded: only 8-bit SAR resolution allowed</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PASS0</name>
      <description>PASS top-level MMIO (PRB, DSABv2, BIST, DSI, INTR)</description>
      <headerStructName>PASS</headerStructName>
      <baseAddress>0x403F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INTR_CAUSE</name>
          <description>Interrupt cause register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F</resetMask>
          <fields>
            <field>
              <name>CTB0_INT</name>
              <description>CTB0 interrupt pending</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTB1_INT</name>
              <description>CTB1 interrupt pending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTB2_INT</name>
              <description>CTB2 interrupt pending</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTB3_INT</name>
              <description>CTB3 interrupt pending</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UAB0_INT</name>
              <description>UAB0 interrupt pending</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UAB1_INT</name>
              <description>UAB1 interrupt pending</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UAB2_INT</name>
              <description>UAB2 interrupt pending</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UAB3_INT</name>
              <description>UAB3 interrupt pending</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG_SYNC</name>
          <description>Trigger synchronization bypass</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>DSI_SYNC0_EN</name>
              <description>Synchronize DSI input 1 (0: bypass synchronization)</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI_SYNC1_EN</name>
              <description>Synchronize DSI input 1 (0: bypass synchronization)</description>
              <bitRange>[19:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI_SYNC2_EN</name>
              <description>Synchronize DSI input 1 (0: bypass synchronization)</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI_SYNC3_EN</name>
              <description>Synchronize DSI input 1 (0: bypass synchronization)</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TRIG_SEL</name>
          <description>Trigger select for SAR</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000000</resetValue>
          <resetMask>0x1F000000</resetMask>
          <fields>
            <field>
              <name>TRIG_SEL</name>
              <description>Trigger select
0=UAB0 half 0 trigger output
1=UAB0 half 1 trigger output
2=UAB1 half 0 trigger output
3=UAB1 half 1 trigger output
4=UAB2 half 0 trigger output
5=UAB2 half 1 trigger output
6=UAB3 half 0 trigger output
7=UAB3 half 1 trigger output
8-30 = generic trigger inputs 0-22
31=SAR trigger output
For PASS4B  only values 0-1 and 8-13 and 31 are legal.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PASS_CTRL</name>
          <description>PASS control</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF03</resetMask>
          <fields>
            <field>
              <name>PMPCLK_BYP</name>
              <description>- 0: Pump clk is clk_hf/2
 - 1: Pump clk is selected from PMPCLK_SRC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMPCLK_SRC</name>
              <description>- 0: Pump clk is clk_hf
 - 1: Pump clk is direct from SRSS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RMB_BITS</name>
              <description>Risk mitigation bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRB_CTRL</name>
          <description>global PRB control</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0000013</resetMask>
          <fields>
            <field>
              <name>VBGR_BUF_GAIN</name>
              <description>N/A</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDA_ENABLE</name>
              <description>- 0: VDDA references disabled (open switch at bottom of resistor ladder)
- 1: VDDA references enabled (close switch at bottom of resistor ladder)
This feature is available in DeepSleep power mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEEPSLEEP_ON</name>
              <description>- 0: PRB IP disabled off during DeepSleep power mode
- 1: PRB IP remains enabled during DeepSleep power mode (if ENABLED=1)
Only VDDA reference is available in DeepSleep power mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>- 0: PRB IP disabled (put analog in power down, open all switches)
- 1: PRB IP enabled</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRB_REF0</name>
          <description>VREF0 control</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF3</resetMask>
          <fields>
            <field>
              <name>VREF0_ENABLE</name>
              <description>0=disconnect, 1= connect &amp; enable resistor string</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF0_SUP_SEL</name>
              <description>Supply select 0: VSUP= VGBR * gain, 1: VSUP= VDDA</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF0_SEL</name>
              <description>Level select, VTOP= VSUP * (VREF_SEL+1)/16 (15: VTOP=VSUP)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRB_REF1</name>
          <description>VREF1 control</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF3</resetMask>
          <fields>
            <field>
              <name>VREF1_ENABLE</name>
              <description>0=disconnect, 1= connect &amp; enable resistor string</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF1_SUP_SEL</name>
              <description>Supply select 0: VSUP= VGBR * gain, 1: VSUP= VDDA</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF1_SEL</name>
              <description>Level select, VTOP= VSUP * (VREF_SEL+1)/16 (15: VTOP=VSUP)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRB_REF2</name>
          <description>VREF2 control</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF3</resetMask>
          <fields>
            <field>
              <name>VREF2_ENABLE</name>
              <description>0=disconnect, 1= connect &amp; enable resistor string</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF2_SUP_SEL</name>
              <description>Supply select 0: VSUP= VGBR * gain, 1: VSUP= VDDA</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF2_SEL</name>
              <description>Level select, VTOP= VSUP * (VREF_SEL+1)/16 (15: VTOP=VSUP)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRB_REF3</name>
          <description>VREF3 control</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF3</resetMask>
          <fields>
            <field>
              <name>VREF3_ENABLE</name>
              <description>0=disconnect, 1= connect &amp; enable resistor string</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF3_SUP_SEL</name>
              <description>Supply select 0: VSUP= VGBR * gain, 1: VSUP= VDDA</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF3_SEL</name>
              <description>Level select, VTOP= VSUP * (VREF_SEL+1)/16 (15: VTOP=VSUP)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNFE_CTRL</name>
          <description>global LNFE control</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC0000000</resetMask>
          <fields>
            <field>
              <name>DEEPSLEEP_ON</name>
              <description>- 0: LNFE IP disabled off during DeepSleep power mode
- 1: LNFE IP remains enabled during DeepSleep power mode (if ENABLED=1)</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>- 0: LNFE IP disabled (put analog in power down, open all switches)
- 1: LNFE IP enabled</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNFE_SW</name>
          <description>LNFE switch control</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0F</resetMask>
          <fields>
            <field>
              <name>LB0</name>
              <description>Connect NPN0 Base to pin P0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LE0</name>
              <description>Connect NPN0 Emitter to pin P6</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LC0</name>
              <description>Connect NPN0 Collector to pin P1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LV0</name>
              <description>Connect NPN0 Collector to Vdda</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LB1</name>
              <description>Connect NPN1 Base to pin P4</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LE1</name>
              <description>Connect NPN1 Emitter to pin P5</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LC1</name>
              <description>Connect NPN1 Collector to pin P3</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LV1</name>
              <description>Connect NPN1 Collector to Vdda</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DSAB</name>
          <description>DSAB configuration</description>
          <addressOffset>0x00000E00</addressOffset>
          <register>
            <name>DSAB_CTRL</name>
            <description>global DSAB control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x910F0F3F</resetMask>
            <fields>
              <field>
                <name>CURRENT_SEL</name>
                <description>DSAB DAC control field

Nominal DSAB Output Current = CURRENT_SEL * 0.075 uA

In products with SRSS-LITE, this setting impacts the CTB(m) offset. A value of 0x20 is used during factory trim and is required to maintain low offsets across temperature variation. If a different setting is used then a periodic re-trim of CTB(m) offset should be performed.</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_OUT</name>
                <description>N/A</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REF_SWAP_EN</name>
                <description>This field (along with SEL_OUT and ENABLED) provides bitwise selection of the current sources that drive the DSAB ZTC and PTAT outputs.

See SEL_OUT field for truth tables.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BYPASS_MODE_EN</name>
                <description>0 - DSAB PTAT generator is powered from DSAB regulator: VDDA must be at least 2.4V
1 - DSAB PTAT generator is pwoered directly from VDDA: VDDA cannot exceed 4.0V</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>STARTUP_RM</name>
                <description>Risk mitigation control                                                                                         
1 - Force start the startup circuit</description>
                <bitRange>[28:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLED</name>
                <description>This field (along with SEL_OUT and REF_SWAP_EN) provides bitwise selection of the current sources that drive the DSAB ZTC and PTAT outputs.
See SEL_OUT field for truth tables.
In SRSSLT devices, in active mode, this bit is overridden to '1', that is - it is always enabled in active mode.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSAB_DFT</name>
            <description>DFT bits</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>EN_DFT</name>
                <description>- 0: DSAB DFT disabled
- 1: DSAB DFT enabled (connect output to amuxbus)

0001 - PTAT&lt;0&gt;
0010 - PTAT&lt;1&gt;
0011 - PTAT&lt;1:0&gt;
0100 - PTAT&lt;2&gt;
0111 - PTAT&lt;2:0&gt;
1000 - PTAT&lt;3&gt;
1111 - PTAT&lt;3:0&gt; 
1001 - DSAB Reg Out</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DSAB_TRIM</name>
          <description>DSAB Trim bits</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>IBIAS_TRIM</name>
              <description>DSAB 1111=lowest, 0000=highest
DSABv2 0000=lowest, 1111=highest</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAB_RMB_BITS</name>
              <description>Risk mitigation bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRB_TRIM</name>
          <description>PRB Trim bits</description>
          <addressOffset>0xF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x33F</resetMask>
          <fields>
            <field>
              <name>VBGR_BUF_TRIM</name>
              <description>6 bits signed value [-32..31], ~1mV per step</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRB_RMB_BITS</name>
              <description>Risk mitigation bits</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>